{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"ab2fc3ad-63a8-54d6-8452-b2e11b8fbce4","excerpt":"","frontmatter":{"path":"/customer-operations","sidebarTitle":"💬 Customer Operations","sidebarGroup":null}}},{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/generic","sidebarTitle":"📄 Generic","sidebarGroup":null}}},{"node":{"id":"7c71a2d0-c97e-5ae1-b734-fd523126ddc2","excerpt":"","frontmatter":{"path":"/executive-support","sidebarTitle":"👭 Executive Support","sidebarGroup":null}}},{"node":{"id":"a900e3df-fe25-5284-8846-c75082303ee0","excerpt":"","frontmatter":{"path":"/frameworks/people","sidebarTitle":"🙂 People","sidebarGroup":null}}},{"node":{"id":"5a958c66-562b-5c23-9825-e3c811f8125d","excerpt":"","frontmatter":{"path":"/product","sidebarTitle":"🚀 Product","sidebarGroup":null}}},{"node":{"id":"85815cc1-bd90-531f-94ef-78c07a8a52d0","excerpt":"","frontmatter":{"path":"/marketing","sidebarTitle":"🎉 Marketing","sidebarGroup":null}}},{"node":{"id":"1c8bb05e-9d2c-5787-a4a1-e910689d93be","excerpt":"","frontmatter":{"path":"/operations/ops-individual-contributor","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations"}}},{"node":{"id":"e7761c75-cd74-588d-82f3-89d80b4101d4","excerpt":"","frontmatter":{"path":"/operations/ops-leadership","sidebarTitle":"🎯 Leadership","sidebarGroup":"operations"}}},{"node":{"id":"8d7734f6-c8bb-5d36-a044-bba4b2bc3d0d","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of most qualitative and quantitative research methods. What's more important, you know their limitations and when to apply them. You've mastered the art of user testing entirely, and know the…","frontmatter":{"path":"/design/user-research","sidebarTitle":"🎯 User Research","sidebarGroup":"design"}}},{"node":{"id":"6d3dd3de-7d8b-5dc3-b9b4-f7673493693c","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of graphic design (layout, type, colour, iconography) and how to put them into practice. You always base your decisions on solid visual design principles and are proficient using the right…","frontmatter":{"path":"/design/visual-design","sidebarTitle":"🎯 Visual Design","sidebarGroup":"design"}}},{"node":{"id":"8918b4d3-bb06-5f88-86e3-7fc79eb47f43","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/backend","sidebarTitle":"🛠️ Backend","sidebarGroup":"engineering"}}},{"node":{"id":"ad52b86d-82ef-56c2-bbc4-80682ec88bbb","excerpt":"Level 1KnowledgeYou are early on in your design career but have an educated understanding of the basics of visual (layout, type, colour, iconography) and interaction design (gestalt, Fitt's law, Hick's law, etc.), along with experience using Sketch…","frontmatter":{"path":"/design/product-design","sidebarTitle":"🎯 Product Design","sidebarGroup":"design"}}},{"node":{"id":"f67c172e-4528-5d10-b43f-6bd1bb51dff9","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/data","sidebarTitle":"📊 Data","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"👩‍💻 Mobile","sidebarGroup":"engineering"}}},{"node":{"id":"f05f09d7-d2a5-5eb8-b020-37b5f6ccfa59","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/web","sidebarTitle":"🌐 Web","sidebarGroup":"engineering"}}},{"node":{"id":"4200b31b-2c3c-5af4-ab54-cec5de9a3b37","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/backend","sidebarTitle":"🛠️ Backend","sidebarGroup":"engineering"}}}]},"pageData":{"html":"","frontmatter":{"path":"/operations/ops-individual-contributor","title":"🙋‍♀️️️ Ops Individual Contributor Framework","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations","yaml":true,"levels":5,"homepage":false,"topics":[{"name":"communication and teamwork","title":"💬 Communication and Teamwork","content":[{"level":1,"criteria":["Clearly articulates what they’re working on and why.","Gives clear concise updates in team meeting and stand ups on material which is relevant for the team"],"exampleCriteria":null},{"level":2,"criteria":["Proactively communicates with stakeholders and tailors communication to audience. Keeps stakeholders like COps, legal, marketing, finance updated on progress and ensures they have what they need.","Gives clear concise updates in cross-team meetings on material which is relevant for the teams","Effectively structures speaking and writing to make sure the right information is given to the right people in a simple way","Understands the objectives of and participates actively in team ceremonies. Prepared and organised to make the most of squad time.","Thinks and acts in the interests of the team over themselves. Unblocks others where they can and proactivley offers feedback on work"],"exampleCriteria":null},{"level":3,"criteria":["Point person for their area of expertise; does whatever is needed to unblock or support the squad and their delivery. Escalates and delegates appropriately.","Communicates effectively to a wide range of stakeholders, e.g. sharing update with ExCo/all hands or community.","Communicates in a professional and Monzo-style way to company (presenting or online) on issues regarding their team."],"exampleCriteria":null},{"level":4,"criteria":["Gathers influence and support for their work, confidently debating and defending their decisions and approach.","Ensures the team has strong relationships with stakeholders, fully recognises their constraints and concerns and creates mutual recognition and trust.","Explains complex concepts simply and delivers difficult messages clearly.","Seamlessly partners with other experts to drive Monzo business goals forward. Drives success both within their team and within the organisation across several teams.","Builds culture of knowledge sharing and documenting of information and processes."],"exampleCriteria":null},{"level":5,"criteria":["Articulates and unites Monzo behind a clear and compelling vision in their domain expertise.","Takes problems and leads others to create solutions through structuring thoughts, asking the right questions and giving context","Confident, clear communicator at All Hands etc. Simplifies messages for teams."],"exampleCriteria":null}]},{"name":"conduct","title":null,"content":[{"level":1,"criteria":["Follows policies and procedures applicable to role. Completes training.","Accepts feedback graciously and acts on it. Gives feedback when requested","Builds relationships within monzo and contributes to building a supportive, knowledgable and engaged peer group"],"exampleCriteria":null},{"level":2,"criteria":["Communicates and escalates risks related to own projects and business area","Works with speed as a habit","Seeks out and gives constructive, actionable feedback where valuable."],"exampleCriteria":null},{"level":3,"criteria":["Promptly and effectively deals with unforeseen risks as they arise.","Seeks out feedback and makes concrete plans to act on this. Proactively and promptly gives useful feedback. Comes to development discussions knowing what they'd like to get out of it.","Constantly learning and looking for new ways to develop. Regularly shares learnings with others so they have more resources to improve with."],"exampleCriteria":null},{"level":4,"criteria":["Responds to complex issues devising smart strategies for the mitigation of risk.","Gets involved in, and identifies, opportunities for the team to participate in advisory, strategic and industry bodies to learn and share best practice in their area of business.","Regularly shares feedback received with team and their plans to work on it."],"exampleCriteria":null},{"level":5,"criteria":["Leads by example and proves their area is managing risk and compliance within appetite."],"exampleCriteria":null}]},{"name":"impact","title":null,"content":[{"level":1,"criteria":["Completes small to medium sized tasks given to them with instruction"],"exampleCriteria":null},{"level":2,"criteria":["Manages medium-sized processes or projects with some instruction","Owns small tasks with minimum support. Drives forward small projects.","Accurately prioritises defined tasks based on effort, impact, user needs and business goals","Takes the initiative to do things or to fix things. Doesn't shy away from picking up new things which need to be done.","Builds processes which scale and strikes the right balance between 'good enough for now' and 'effective use of resources'","Acts in terms of areas they are responsible for managing, rather than tasks they are responsbile for doing"],"exampleCriteria":null},{"level":3,"criteria":["Owns problems, generates solutions and leads implementation.","Manages large or complex projects or areas with some instruction.","Drives forward or initiates medium sized, relatively-complex processes or projects with minimum support.","Prioritises defined projects based on effort, impact, user needs and business goals.","Identifies problems that need solving. Accurately scopes out length and difficulty of tasks and projects.","Comfortable changing direction quickly where required.","Effectively navigates challenging trade-offs between achieving goals and ensuring optimal customer experience."],"exampleCriteria":null},{"level":4,"criteria":["Manages very large or highly complex areas or multiple projects with some instruction.","Drives forward or initiates large/complex projects or owns an area with minimum support.","Prioritises multiple ambiguous large projects based on effort, impact, user needs and business goals. Encourages others to prioritise effectively and gives them the tools and guidance to do so.","Identifies high-impact or complex problems the company will face down the line, in their domain.","Prioritises most impactful problems to work on with awareness of future risks.","Identifies anything which could impinge on Monzo’s ability to deliver world-class customer service.","Can design practices, processes, and procedures which allow managing from a distance."],"exampleCriteria":null},{"level":5,"criteria":["Fully owns large areas or projects with no support.","Constantly prioritises multiple efforts effectively on multiple dimensions - makes sure the urgent doesn’t always outdo the important; that there is a balance between new work, maintenance, fixing issues; long- and short-term work.","Retains accountability until problem fully resolved."],"exampleCriteria":null}]},{"name":"knowledge","title":null,"content":[{"level":1,"criteria":["Knows what they need to do their role, knows who to go to if they don't know something.","Proactivley seeks out the information they need to solve a problem.","Consistently striving to learn more."],"exampleCriteria":null},{"level":2,"criteria":["Go to person within the team on their area. Team defaults to their opinion where there is uncertainty.","Knows which areas they know the best and proactively advises on these areas in team discussions and planning","Works to increase their and their team's knowledge in these areas"],"exampleCriteria":null},{"level":3,"criteria":["Go to expert within company, e.g. invited to give opinion at C Suite meetings.","Understands technical proposals within their area and the business implications of these.","Works to increase company knowledge in multiple areas."],"exampleCriteria":null},{"level":4,"criteria":["Works to increase industry knowledge in their core area.","A key commentator on the industry, e.g. invited to give opinion at external committees, publishes blogs and disseminates knowledge to team.","Challenges proposed solutions in order to get to better ones. Comfortable challenging technical proposals within their area.","Constantly teaching and looking for new ways to share knowledge and skills with others."],"exampleCriteria":null},{"level":5,"criteria":["Contantly innovating, learning and teaching and looking for new ways to do things which haven't been done before. Shares these new ways of doing things internally and externally. Is a recognised industry expert outside of Monzo.","Comfortable creating optimal technical proposals within their area of expertise."],"exampleCriteria":null}]}]}},"genericData":{"html":"","frontmatter":{"path":"/generic","title":"📄 Generic Framework","sidebarTitle":"📄 Generic","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"knowledge","title":"🧠 Knowledge","content":[{"level":1,"criteria":["Learning just as much as adding value","Has enough knowledge to make informed decisions","Doesn’t necessarily know what they don’t know"]},{"level":2,"criteria":["Identifies areas/subjects they don’t know and proactively seeks out knowledge","Increased domain knowledge","Aware of their weaknesses"]},{"level":3,"criteria":["Additional expertise or breadth of knowledge"]},{"level":4,"criteria":["Has depth of knowledge in a particular area and breadth of knowledge across their domain","You know who the experts are and delegate accordingly"]},{"level":5,"criteria":["Wide breadth of knowledge","Can easily context switch within their area and pick up new concepts"]},{"level":6,"criteria":["Has a high-level understanding of all the areas they own","Understands the wider business context"]}]},{"name":"impact","title":"💥 Impact","content":[{"level":1,"criteria":["Independently works on small, low-impact, well-defined task","Looks to optimise existing work (eg Processes, procedures, products, etc)"]},{"level":2,"criteria":["Delivers small, well-defined tasks/projects","Delegated low-impact problems to solve"]},{"level":3,"criteria":["Identifies problems to solve","Owns the implementation of the solution"]},{"level":4,"criteria":["Can take a long-term vision and define building blocks to get there"]},{"level":5,"criteria":["Understands the big picture and integrates company goals into their area"]},{"level":6,"criteria":["Is the accountable exec for high-impact projects"]}]},{"name":"communication","title":"💬 Communication","content":[{"level":1,"criteria":["Actively communicates what they are working on","Seeks out feedback"]},{"level":2,"criteria":["Can deliver their work to their team and others","Proactively gives feedback to those they work with"]},{"level":3,"criteria":["Clearly communicates throughout implementation of solutions","Can successfully get buy-in for their proposals"]},{"level":4,"criteria":["Communicates their area’s role within the larger mission of the company"]},{"level":5,"criteria":["Communicates the long-term vision & mission for the company and their area"]},{"level":6,"criteria":["An effective and inspiring communicator internally and externally"]}]},{"name":"teamwork","title":"🤝 Teamwork","content":[{"level":1,"criteria":["Works closely or in pairs with more senior members of the team when facing tasks for the first time","Needs support and guidance from managers, mentors and leads","Needs approval to ship projects of a certain impact","They may need support on how to navigate the professional environment"]},{"level":2,"criteria":["Starts to delegate tasks to peers","Collaborates within their team","Independently works and learns","Do not need to be checked in on daily"]},{"level":3,"criteria":["Collaborates across the organisation","Strong cultural understanding","Empowers those around them","Takes ownership of their own development"]},{"level":4,"criteria":["Leads through influence","Natural teacher, they’re able to formally and informally teach those around them","You unblock people within your area","You’re recognised for your impact on team culture and people want to work with you"]},{"level":5,"criteria":["You coach others to find the best solution","You inspire your team and can attract top talent to the organisation","You unblock people outside of your area"]},{"level":6,"criteria":["Leader of business culture and strategy","You own your area’s structure","Strong leadership and coaching abilities"]}]},{"name":"conduct","title":"👩‍💻 Conduct","content":[{"level":1,"criteria":["Follows policies and procedures applicable to role","Completes training","Identifies risks related to own areas"]},{"level":2,"criteria":["Applies and follows governance principles as they apply to role","Communicates and escalates risks related to own projects and business area","Ensures colleagues actively analyse and address risks in their area"]},{"level":3,"criteria":["Expert risk and compliance knowledge as relevant to role","Takes ownership for training others in risk & compliance as relevant to their role","Promptly and effectively deals with unforeseen risks as they arise"]},{"level":4,"criteria":["Uses knowledge of internal and external environment to develop strategy and internal policy","Applies sophisticated and creative analysis and recommends remediating action","Responds to complex issues devising smart strategies for the mitigation of risk"]},{"level":5,"criteria":["Participates in risk management and mitigation at the highest industry level","Leads by example and proves their area is managing risk and compliance within appetite","Gets involved in and identifies opportunities for colleagues to participate in advisory, strategic, industry bodies to learn and share best practice in their area of business"]},{"level":6,"criteria":["Creates a strong risk culture throughout the organisation","Owns policies and can evidence their compliance","Contributes to thought leadership on effective and creative risk management throughout the industry","Proactively identifies holistic measures to robust risk management and implements them company-wide"]}]}]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"isYaml":true}}