{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"ab2fc3ad-63a8-54d6-8452-b2e11b8fbce4","excerpt":"","frontmatter":{"path":"/customer-operations","sidebarTitle":"💬 Customer Operations","sidebarGroup":null}}},{"node":{"id":"7c71a2d0-c97e-5ae1-b734-fd523126ddc2","excerpt":"","frontmatter":{"path":"/executive-support","sidebarTitle":"👭 Executive Support","sidebarGroup":null}}},{"node":{"id":"a900e3df-fe25-5284-8846-c75082303ee0","excerpt":"","frontmatter":{"path":"/frameworks/people","sidebarTitle":"🙂 People","sidebarGroup":null}}},{"node":{"id":"5a958c66-562b-5c23-9825-e3c811f8125d","excerpt":"","frontmatter":{"path":"/product","sidebarTitle":"🚀 Product","sidebarGroup":null}}},{"node":{"id":"85815cc1-bd90-531f-94ef-78c07a8a52d0","excerpt":"","frontmatter":{"path":"/marketing","sidebarTitle":"🎉 Marketing","sidebarGroup":null}}},{"node":{"id":"1c8bb05e-9d2c-5787-a4a1-e910689d93be","excerpt":"","frontmatter":{"path":"/operations/ops-individual-contributor","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations"}}},{"node":{"id":"e7761c75-cd74-588d-82f3-89d80b4101d4","excerpt":"","frontmatter":{"path":"/operations/ops-leadership","sidebarTitle":"🎯 Leadership","sidebarGroup":"operations"}}},{"node":{"id":"8d7734f6-c8bb-5d36-a044-bba4b2bc3d0d","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of most qualitative and quantitative research methods. What's more important, you know their limitations and when to apply them. You've mastered the art of user testing entirely, and know the…","frontmatter":{"path":"/design/user-research","sidebarTitle":"🎯 User Research","sidebarGroup":"design"}}},{"node":{"id":"6d3dd3de-7d8b-5dc3-b9b4-f7673493693c","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of graphic design (layout, type, colour, iconography) and how to put them into practice. You always base your decisions on solid visual design principles and are proficient using the right…","frontmatter":{"path":"/design/visual-design","sidebarTitle":"🎯 Visual Design","sidebarGroup":"design"}}},{"node":{"id":"ad52b86d-82ef-56c2-bbc4-80682ec88bbb","excerpt":"Level 1KnowledgeYou are early on in your design career but have an educated understanding of the basics of visual (layout, type, colour, iconography) and interaction design (gestalt, Fitt's law, Hick's law, etc.), along with experience using Sketch…","frontmatter":{"path":"/design/product-design","sidebarTitle":"🎯 Product Design","sidebarGroup":"design"}}},{"node":{"id":"de5aa58c-75f9-51ad-84c1-b8512f59b06a","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️Front-end","sidebarGroup":"engineering"}}},{"node":{"id":"adb3e47c-a965-5f39-bf8c-b71ee096ebd5","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/back-end","sidebarTitle":"🛠️Back-end","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"🛠️Mobile","sidebarGroup":"engineering"}}},{"node":{"id":"7bee2609-6bc3-522f-abeb-e751decf8cd2","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/platform-engineer","sidebarTitle":"🛠️Platform Engineer","sidebarGroup":"engineering"}}},{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/generic","sidebarTitle":"📄 Generic","sidebarGroup":null}}}]},"pageData":{"html":"","frontmatter":{"path":"/frameworks/people","title":"🙂 People","sidebarTitle":"🙂 People","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"communication","title":null,"content":[{"level":1,"criteria":["Contributes ideas to influence policy, process and decisions.","Pro-actively communicates what they're working on with their team and stakeholders","Proactively gives feedback to people they work with; both affirmative and developmental.","Uses information, resources and support from others outside their own immediate team to get results."],"exampleCriteria":null},{"level":2,"criteria":["Finds the best way to communicate updates with the People team and wider stakeholders during meetings/committees.","Shares insight and work with the wider business effectively to support Monzo plans and priorities. Can prepare information and present in a way that takes into account the different levels of detail different audiences need.","Runs meetings well inside and outside the People team."],"exampleCriteria":null},{"level":3,"criteria":["Shares insight and work with Monzonauts (across People or their specialist area) to influence the development of Monzo plans and priorities. Understands how to manage stakeholder involvement.","Is comfortable with critical conversations, and gives useful actionable feedback that gets good results.","Supports and coaches Monzonauts, particularly managers, in understanding and complying with ER policies and practices."],"exampleCriteria":null},{"level":4,"criteria":["Communicates their area’s role within the larger mission of the company.","Leads and influences change across different teams to help major initiatives happen.","Coaches and builds senior managers' ability to anticipate and pre-empt organisation issues."],"exampleCriteria":null},{"level":5,"criteria":["Communicates the long-term vision and mission for the company and their area.","Leads and champions implementing the most significant organisation change activities.","Leads people and Monzo strategic development to address risks and opportunities for the organisation.","Uses insight about opportunities and risks to influence executive team decisions that affect the long-term reputation, health and growth of the organisation."],"exampleCriteria":null},{"level":6,"criteria":["An effective and inspiring communicator internally and externally."],"exampleCriteria":null}]},{"name":"impact","title":null,"content":[{"level":1,"criteria":["Completes tasks efficiently and to a high standard.","Answers questions efficiently in the Monzo tone of voice.","Prioritises work to keep a balance between important / not important / urgent / not urgent."],"exampleCriteria":null},{"level":2,"criteria":["Begins to delegate tasks out to their team so they can focus on more complex projects.","Focuses on important, urgent work while not losing sight of other things.","Regularly reviews and improves processes to make sure they're still working hard for Monzonauts."],"exampleCriteria":null},{"level":3,"criteria":["Works on large-scale projects or manages complex verticals: changes existing policies, processes and communications to align with company priorities and team goals.","Is ultimately responsible for changing processes in their area.","Delegates well, so they can take on bigger more complex projects, and to help other people develop."],"exampleCriteria":null},{"level":4,"criteria":["Tactical advisor to executive - opinions and advice often sought","Can take a long-term vision and define building blocks to get there.","Can prioritise projects and other people's time to meet company demands while not losing sight of BAU work; making sure the team is working on the things that have the biggest impact.","Develops action plans to mitigate the risk of implementing new people policies and plans.","Looks after delivering and evaluating significant on-going, annual and planned ‘one-off’ people programmes and projects."],"exampleCriteria":null},{"level":5,"criteria":["Understands the big picture and integrates company goals into their area.","Assesses and reviews the impact of projects/solutions, staying alert to changes in context, and makes appropriate corrections to strategy and solutions.","Leads risk mitigation, governance and ethics strategies for the People Team.","Sponsors and evaluates delivery big high-impact people programmes and projects across the organisation."],"exampleCriteria":null},{"level":6,"criteria":["Is the accountable exec for high-impact projects."],"exampleCriteria":null}]},{"name":"knowledge","title":null,"content":[{"level":1,"criteria":["Understands general people processes they need for their role and can use people tools.","Pulls knowledge from well defined processes and procedures.","Works autonomously but asks for guidance where they need to. Delivers high quality, accurate work."],"exampleCriteria":null},{"level":2,"criteria":["Knows a lot about their area and is becoming a specialist.","Shows their commitment to personal development by learning more about other areas in the People domain.","Spots trends using our tooling and data to make change happen."],"exampleCriteria":null},{"level":3,"criteria":["Is an owner of a verticle within People (like ER), or acts as a project lead for quarterly goals.","Knows who to work with across teams in Monzo to get the best results.","Understands industry trends and processes and is able to interpret them to make them effective at Monzo.","Shares insight and work with Monzonauts (across People or their specialist area) to influence the development of Monzo plans and priorities."],"exampleCriteria":null},{"level":4,"criteria":["Has in-depth of knowledge in a particular area and breadth of knowledge across their domain; working towards CIPD Level 7 or equivalent.","Can challenge and educate people based on their skills and experience.","Assesses and interprets complex data and feedback to gain insights about Monzo to anticipate the needs of the org in the future."],"exampleCriteria":null},{"level":5,"criteria":["Wide breadth of knowledge.","Can easily context switch within their area and pick up new concepts; People Operations, Hiring, Reward and Recognition, L&D","Strong generalist People skill set including experience in creating inspiring cultures, developing talent and quickly scaling up businesses."],"exampleCriteria":null},{"level":6,"criteria":["Has a high-level understanding of all the areas they own.","Understands the wider business context."],"exampleCriteria":null}]},{"name":"teamwork","title":null,"content":[{"level":1,"criteria":["Works collaboratively with their team to get results.","Builds relationships with teams across Monzo to keep a customer focus in all projects and regular work.","Owns an area of day-to-day work and gives updates to the team and wider business when they need to.","Proactively suggests ways to improve current processes and works with the team to make it happen. Writes documentation for changes and produces quality how-tos."],"exampleCriteria":null},{"level":2,"criteria":["Helps keep track of actions and goals for the team.","Can onboard new members of the team and act as a mentor for processes and project work.","Works independently on projects but brings the right people in at the right time."],"exampleCriteria":null},{"level":3,"criteria":["Collaborates across teams to achieve a common goal.","Supports and coaches those around them, encouraging a learning environment where others are inspired and motivated.","Takes ownership of their own development and makes progress on their Personal Development Goals.","Has a strong cultural understanding, and makes decisions based on cultural awareness that compliments legislation and Monzo policy.","Networks with specialist colleagues and communities of practice to understand current trends, thinking and innovations in People and specialist areas."],"exampleCriteria":null},{"level":4,"criteria":["Leads through influence, building up a network of strong relationships and presenting their ideas in the right way to lead others in the right direction.","A natural teacher who can formally and informally teach those around them.","Unblocks people within their area, coaching others to come up with answers to problems.","Recognised for their impact on team culture, so people want to work with them.","Partners with colleagues (across People and in specialist areas) and leaders to develop shared insights, priorities and activities as part of Monzo plans and goals.","Build relationships and forms alliances with internal and external specialists and communities to keep ahead of emerging People and specialist trends, ideas and innovations, and to keep ahead of changes."],"exampleCriteria":null},{"level":5,"criteria":["Coaches senior leadership team and helps them to anticipate and pre-empt organisation issues.","Inspires the team and can attract top talent to Monzo.","Unblocks people inside and outside their area by coaching others to come up with answers to problems.","Develops strong and trusted partnerships with our leadership team to challenge, guide and advise; holds executives to account for their behaviours and values.","Establishes a network of internal and external counterparts and executive communities of practice to keep ahead of emerging People and specialist trends, ideas and industry/sector insights, locally and internationally."],"exampleCriteria":null},{"level":6,"criteria":["Is a leader of business culture and strategy.","Owns their area’s structure.","Has strong leadership and coaching abilities."],"exampleCriteria":null}]},{"name":"conduct","title":null,"content":[{"level":1,"criteria":["Understands people risk and conduct policies and procedures and follows them. Leads by example, in line with Monzo culture outlined in our Code of Conduct and other People policies. Identifies risks related to own areas and shares risks with their manager.","Brings a creative mindset to their role, starting from first principles where appropriate.","Approaches their role within the Monzo community with empathy and fairness, understanding that fair does not always mean equal. Treats every Monzonaut with respect and kindness.","Proactively forms relationships across Monzo and acts inclusively at all times. Acts as a role model for the People team and offers guidance and support to all Monzoanuts."],"exampleCriteria":null},{"level":2,"criteria":["Applies and follows governance principles. Communicates and escalates risks related to their own projects and business area. Works with other Monzonauts to help them analyse and address risks in their area.","Puts diversity and inclusion at the heart of all new work. Has strong relationships with Monzonauts across the business and proactively welcomes new joiners.","Understands the importance of work-life harmony and acts as a role model for this. Is a driven and committed Monzonaut, understanding that sprints are neccessary but not a way of life."],"exampleCriteria":null},{"level":3,"criteria":["Is an expert in risk and compliance issues related to their role. Takes ownership for training others in risk & compliance as relevant to their role.","Understands their role as an emerging leader and guides and supports other Monzonauts.","Promptly and effectively deals with unforeseen risks/events as they arise and proactively shares the learnings. Understands that ambitious teams will fail sometimes, and that's okay.","Makes sure diversity and inclusion considerations are embedded in what the People team does."],"exampleCriteria":null},{"level":4,"criteria":["Uses their knowledge of the internal and external environment to develop strategy and internal policy. Applies sophisticated and creative analysis and spots ways to fix things that aren't working.","Assesses and interprets complex data and feedback to gain insights about Monzo, its customers and its broader context. Responds to complex issues by devising smart strategies to mitigate risk.","Use insights to influence leaders and colleagues to current risks or benefits of decisions or actions that affect the long-term reputation and health of Monzo.","Brings people along with them and acts as a supporter for all members of the People team. Understands their responsibility as a leader at Monzo and reflects that responsibility in their behaviour.","Encourages fast execution within the People team while keeping focus on legal and legislative requirements. Creates momentum and keeps the team motivated and engaged."],"exampleCriteria":null},{"level":5,"criteria":["Is involved with risk management and mitigation at the highest industry level.","Leads by example and proves their area is managing risk and compliance within appetite.","Gets involved in and identifies opportunities for colleagues to participate in advisory, strategic, industry bodies to learn and share best practice in their area of business.","Assesses and shapes organisational culture to meet current and future challenges.","Assesses the changing social, strategic and business/economic environment to gain insights and identify organisational strategic requirements."],"exampleCriteria":null},{"level":6,"criteria":["Creates a strong risk culture throughout the organisation. Owns policies and can prove we're complying with them. Spots ways to manage risk and implements them company wide.","Contributes to thought leadership on effective and creative ways to run an excellent org from a People perspective."],"exampleCriteria":null}]}]}},"genericData":{"html":"","frontmatter":{"path":"/generic","title":"📄 Generic Framework","sidebarTitle":"📄 Generic","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"priorize-simplifique","title":"💥 Priorize e Simplifiquee","content":[{"level":1,"criteria":["Trabalha de forma independente em tarefas pequenas, de menor complexidade e bem definidas","Procura otimizar o trabalho existente (por exemplo, processos, procedimentos, produtos, etc.)","Trabalha de acordo com a urgência e priorização estabelecida"]},{"level":2,"criteria":["Realiza com qualidade tarefas e projetos que estão sob sua responsabilidade","Consegue determinar o impacto relativo e a urgência de tarefas individuais"]},{"level":3,"criteria":["Identifica novos problemas a serem resolvidos, dentro e fora de sua área","Implementa soluções para problemas identificados","Ajuda os outros a identificar e priorizar tarefas"]},{"level":4,"criteria":["Tem uma visão de longo prazo e define blocos de construção para chegar no objetivo","Determina e discute sobre projetos ou tarefas focar primeiro","Melhora a gestão da carga de horário de trabalho apoiando os outros no estabelecimento de prioridades"]},{"level":5,"criteria":["Compreende a visão geral e integra os objetivos da empresa em sua área","Garante que os projetos relevantes da empresa obtenham os recursos adequados","Gerencia vários projetos paralelos e estabelece prioridades de acordo com as necessidades do negócio"]},{"level":6,"criteria":["É o executivo responsável por projetos de alto impacto","Prioriza e equilibra os projetos considerando se é de curto, médio e longo prazo","Expressa opinião sobre as prioridades e colabora com os outros líderes sênior para determinar a importância das questões levantadas na organização."]}]},{"name":"ideias","title":"🧠 Ideias valem mais do que cargos","content":[{"level":1,"criteria":["Demonstra vontade de aprender continuamente","Apoia a criatividade em outros ao ouvir as ideias","Compartilha a própria perspectiva"]},{"level":2,"criteria":["Demonstra curiosidade e sugere mudanças em potencial","Contribui com a geração de ideias","Identifica oportunidades de melhorias dentro da própria função"]},{"level":3,"criteria":["Vê problemas antigos e estado atual em novas maneiras para gerar soluções eficazes","Faz perguntas para estimular o pensamento inovador nos outros","Busca oportunidades e soluções criativas que ajudarão a melhorar o desempenho da equipe"]},{"level":4,"criteria":["Gera novas ideias, métodos, produtos ou soluções continuamente e age sobre novas ideias avaliando e testando os riscos","Incentiva os outros a compartilhar, construir e desafia abertamente as novas ideias uns dos outros"]},{"level":5,"criteria":["Analisa diversas ideias em potencial e avalia cada uma de acordo com as metas do negócio","Aceita falha como uma parte necessária da inovação","Treina os outros para ter perspectivas diferentes, agindo como advogado para novas ideias","Busca novas possibilidades e oportunidades para “manter-se um passo à frente”"]},{"level":6,"criteria":["Assume riscos e visiona o que pode não existir hoje e colabora com os outros para gerar estratégias e dar vida a novas visões","Incentiva os outros a experimentar e aprender com o erro","Busca oportunidades e áreas de negócio onde soluções criativas ajudarão a melhorar a produtividade"]}]},{"name":"communication","title":"💬 Communication","content":[{"level":1,"criteria":["Actively communicates what they are working on","Seeks out feedback"]},{"level":2,"criteria":["Can deliver their work to their team and others","Proactively gives feedback to those they work with"]},{"level":3,"criteria":["Clearly communicates throughout implementation of solutions","Can successfully get buy-in for their proposals"]},{"level":4,"criteria":["Communicates their area’s role within the larger mission of the company"]},{"level":5,"criteria":["Communicates the long-term vision & mission for the company and their area"]},{"level":6,"criteria":["An effective and inspiring communicator internally and externally"]}]},{"name":"seu-problema-meu-problema","title":"🤝 Seu problema, meu problema","content":[{"level":1,"criteria":["Realiza tarefas e responsabilidades específica, fornecendo informações aos outros","Trabalha de modo colaborativo com os membros da equipe para realizar bem o próprio trabalho","Mostra-se disponível a ajudar e colaborar com o trabalho do outro membro da equipe para o bem do coletivo"]},{"level":2,"criteria":["Colabora dentro de sua equipe. Reconhece os papéis dos membros da equipe e como o próprio papel contribui para as metas em comum","Compartilha informações com outros de modo oportuno, oferece suporte aos outros sempre que possível"]},{"level":3,"criteria":["Colabora com membros de outras equipes, estabelecendo e aumentando os relacionamento de trabalho","Busca e incentiva ideias diferentes e diversas dos outros","Capacita os que estão ao seu redor"]},{"level":4,"criteria":["Ensina formal e informalmente aqueles que os rodeiam","Comunica-se dentro e entre equipes para remover barreiras","É reconhecido pelo seu impacto na cultura de equipe e as pessoas querem trabalhar com você"]},{"level":5,"criteria":["Treina os outros para encontrar a melhor solução","Inspira sua equipe e pode atrair os melhores talentos para a organização","Gera cooperação entre equipes","Motiva os membros da equipe e promove os valores da companhia"]},{"level":6,"criteria":["Líder da cultura e estratégia de negócios","Liderança forte e habilidades de coaching","Estabelece uma rede ativa de compartilhamento de informações","Busca e constrói relacionamentos pela organização"]}]},{"name":"conduct","title":"👩‍💻 Conduct","content":[{"level":1,"criteria":["Follows policies and procedures applicable to role","Completes training","Identifies risks related to own areas"]},{"level":2,"criteria":["Applies and follows governance principles as they apply to role","Communicates and escalates risks related to own projects and business area","Ensures colleagues actively analyse and address risks in their area"]},{"level":3,"criteria":["Expert risk and compliance knowledge as relevant to role","Takes ownership for training others in risk & compliance as relevant to their role","Promptly and effectively deals with unforeseen risks as they arise"]},{"level":4,"criteria":["Uses knowledge of internal and external environment to develop strategy and internal policy","Applies sophisticated and creative analysis and recommends remediating action","Responds to complex issues devising smart strategies for the mitigation of risk"]},{"level":5,"criteria":["Participates in risk management and mitigation at the highest industry level","Leads by example and proves their area is managing risk and compliance within appetite","Gets involved in and identifies opportunities for colleagues to participate in advisory, strategic, industry bodies to learn and share best practice in their area of business"]},{"level":6,"criteria":["Creates a strong risk culture throughout the organisation","Owns policies and can evidence their compliance","Contributes to thought leadership on effective and creative risk management throughout the industry","Proactively identifies holistic measures to robust risk management and implements them company-wide"]}]}]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"isYaml":true}}