{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"7c71a2d0-c97e-5ae1-b734-fd523126ddc2","excerpt":"","frontmatter":{"path":"/executive-support","sidebarTitle":"👭 Executive Support","sidebarGroup":null}}},{"node":{"id":"85815cc1-bd90-531f-94ef-78c07a8a52d0","excerpt":"","frontmatter":{"path":"/marketing","sidebarTitle":"🎉 Marketing","sidebarGroup":null}}},{"node":{"id":"ab2fc3ad-63a8-54d6-8452-b2e11b8fbce4","excerpt":"","frontmatter":{"path":"/customer-operations","sidebarTitle":"💬 Customer Operations","sidebarGroup":null}}},{"node":{"id":"ad52b86d-82ef-56c2-bbc4-80682ec88bbb","excerpt":"Level 1 Knowledge You are early on in your design career but have an educated understanding of the basics of visual (layout, type, colour, iconography) and interaction design (gestalt, Fitt's law, Hick's law, etc.), along with experience using Sketch…","frontmatter":{"path":"/design/product-design","sidebarTitle":"🎯 Product Design","sidebarGroup":"design"}}},{"node":{"id":"5a958c66-562b-5c23-9825-e3c811f8125d","excerpt":"","frontmatter":{"path":"/product","sidebarTitle":"🚀 Product","sidebarGroup":null}}},{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/generic","sidebarTitle":"📄 Generic","sidebarGroup":null}}},{"node":{"id":"8d7734f6-c8bb-5d36-a044-bba4b2bc3d0d","excerpt":"Level 1 Knowledge You understand the theory and fundamentals of most qualitative and quantitative research methods. What's more important, you know their limitations and when to apply them. You've mastered the art of user testing entirely, and know…","frontmatter":{"path":"/design/user-research","sidebarTitle":"🎯 User Research","sidebarGroup":"design"}}},{"node":{"id":"a900e3df-fe25-5284-8846-c75082303ee0","excerpt":"","frontmatter":{"path":"/frameworks/people","sidebarTitle":"🙂 People","sidebarGroup":null}}},{"node":{"id":"6d3dd3de-7d8b-5dc3-b9b4-f7673493693c","excerpt":"Level 1 Knowledge You understand the theory and fundamentals of graphic design (layout, type, colour, iconography) and how to put them into practice. You always base your decisions on solid  visual design principles  and are proficient using the…","frontmatter":{"path":"/design/visual-design","sidebarTitle":"🎯 Visual Design","sidebarGroup":"design"}}},{"node":{"id":"de5aa58c-75f9-51ad-84c1-b8512f59b06a","excerpt":"About our engineering progression frameworks The engineering progression framework is a tool that helps engineers and managers: make development and career plans talk about what we’re looking for from engineers in a consistent way set a fair level of…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️Front-end","sidebarGroup":"engineering"}}},{"node":{"id":"adb3e47c-a965-5f39-bf8c-b71ee096ebd5","excerpt":"About our engineering progression frameworks The engineering progression framework is a tool that helps engineers and managers: make development and career plans talk about what we’re looking for from engineers in a consistent way set a fair level of…","frontmatter":{"path":"/engineering/back-end","sidebarTitle":"🛠️Back-end","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"About our engineering progression frameworks The engineering progression framework is a tool that helps engineers and managers: make development and career plans talk about what we’re looking for from engineers in a consistent way set a fair level of…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"🛠️Mobile","sidebarGroup":"engineering"}}},{"node":{"id":"1c8bb05e-9d2c-5787-a4a1-e910689d93be","excerpt":"","frontmatter":{"path":"/operations/ops-individual-contributor","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations"}}},{"node":{"id":"7bee2609-6bc3-522f-abeb-e751decf8cd2","excerpt":"About our engineering progression frameworks The engineering progression framework is a tool that helps engineers and managers: make development and career plans talk about what we’re looking for from engineers in a consistent way set a fair level of…","frontmatter":{"path":"/engineering/platform-engineer","sidebarTitle":"🛠️Platform Engineer","sidebarGroup":"engineering"}}},{"node":{"id":"e7761c75-cd74-588d-82f3-89d80b4101d4","excerpt":"","frontmatter":{"path":"/operations/ops-leadership","sidebarTitle":"🎯 Leadership","sidebarGroup":"operations"}}}]},"pageData":{"html":"","frontmatter":{"path":"/operations/ops-individual-contributor","title":"🙋‍♀️️️ Ops Individual Contributor Framework","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations","yaml":true,"levels":5,"homepage":false,"topics":[{"name":"communication and teamwork","title":"💬 Communication and Teamwork","content":[{"level":1,"criteria":["Clearly articulates what they’re working on and why.","Gives clear concise updates in team meeting and stand ups on material which is relevant for the team"],"exampleCriteria":null},{"level":2,"criteria":["Proactively communicates with stakeholders and tailors communication to audience. Keeps stakeholders like COps, legal, marketing, finance updated on progress and ensures they have what they need.","Gives clear concise updates in cross-team meetings on material which is relevant for the teams","Effectively structures speaking and writing to make sure the right information is given to the right people in a simple way","Understands the objectives of and participates actively in team ceremonies. Prepared and organised to make the most of squad time.","Thinks and acts in the interests of the team over themselves. Unblocks others where they can and proactivley offers feedback on work"],"exampleCriteria":null},{"level":3,"criteria":["Point person for their area of expertise; does whatever is needed to unblock or support the squad and their delivery. Escalates and delegates appropriately.","Communicates effectively to a wide range of stakeholders, e.g. sharing update with ExCo/all hands or community.","Communicates in a professional and Monzo-style way to company (presenting or online) on issues regarding their team."],"exampleCriteria":null},{"level":4,"criteria":["Gathers influence and support for their work, confidently debating and defending their decisions and approach.","Ensures the team has strong relationships with stakeholders, fully recognises their constraints and concerns and creates mutual recognition and trust.","Explains complex concepts simply and delivers difficult messages clearly.","Seamlessly partners with other experts to drive Monzo business goals forward. Drives success both within their team and within the organisation across several teams.","Builds culture of knowledge sharing and documenting of information and processes."],"exampleCriteria":null},{"level":5,"criteria":["Articulates and unites Monzo behind a clear and compelling vision in their domain expertise.","Takes problems and leads others to create solutions through structuring thoughts, asking the right questions and giving context","Confident, clear communicator at All Hands etc. Simplifies messages for teams."],"exampleCriteria":null}]},{"name":"conduct","title":null,"content":[{"level":1,"criteria":["Follows policies and procedures applicable to role. Completes training.","Accepts feedback graciously and acts on it. Gives feedback when requested","Builds relationships within monzo and contributes to building a supportive, knowledgable and engaged peer group"],"exampleCriteria":null},{"level":2,"criteria":["Communicates and escalates risks related to own projects and business area","Works with speed as a habit","Seeks out and gives constructive, actionable feedback where valuable."],"exampleCriteria":null},{"level":3,"criteria":["Promptly and effectively deals with unforeseen risks as they arise.","Seeks out feedback and makes concrete plans to act on this. Proactively and promptly gives useful feedback. Comes to development discussions knowing what they'd like to get out of it.","Constantly learning and looking for new ways to develop. Regularly shares learnings with others so they have more resources to improve with."],"exampleCriteria":null},{"level":4,"criteria":["Responds to complex issues devising smart strategies for the mitigation of risk.","Gets involved in, and identifies, opportunities for the team to participate in advisory, strategic and industry bodies to learn and share best practice in their area of business.","Regularly shares feedback received with team and their plans to work on it."],"exampleCriteria":null},{"level":5,"criteria":["Leads by example and proves their area is managing risk and compliance within appetite."],"exampleCriteria":null}]},{"name":"impact","title":null,"content":[{"level":1,"criteria":["Completes small to medium sized tasks given to them with instruction"],"exampleCriteria":null},{"level":2,"criteria":["Manages medium-sized processes or projects with some instruction","Owns small tasks with minimum support. Drives forward small projects.","Accurately prioritises defined tasks based on effort, impact, user needs and business goals","Takes the initiative to do things or to fix things. Doesn't shy away from picking up new things which need to be done.","Builds processes which scale and strikes the right balance between 'good enough for now' and 'effective use of resources'","Acts in terms of areas they are responsible for managing, rather than tasks they are responsbile for doing"],"exampleCriteria":null},{"level":3,"criteria":["Owns problems, generates solutions and leads implementation.","Manages large or complex projects or areas with some instruction.","Drives forward or initiates medium sized, relatively-complex processes or projects with minimum support.","Prioritises defined projects based on effort, impact, user needs and business goals.","Identifies problems that need solving. Accurately scopes out length and difficulty of tasks and projects.","Comfortable changing direction quickly where required.","Effectively navigates challenging trade-offs between achieving goals and ensuring optimal customer experience."],"exampleCriteria":null},{"level":4,"criteria":["Manages very large or highly complex areas or multiple projects with some instruction.","Drives forward or initiates large/complex projects or owns an area with minimum support.","Prioritises multiple ambiguous large projects based on effort, impact, user needs and business goals. Encourages others to prioritise effectively and gives them the tools and guidance to do so.","Identifies high-impact or complex problems the company will face down the line, in their domain.","Prioritises most impactful problems to work on with awareness of future risks.","Identifies anything which could impinge on Monzo’s ability to deliver world-class customer service.","Can design practices, processes, and procedures which allow managing from a distance."],"exampleCriteria":null},{"level":5,"criteria":["Fully owns large areas or projects with no support.","Constantly prioritises multiple efforts effectively on multiple dimensions - makes sure the urgent doesn’t always outdo the important; that there is a balance between new work, maintenance, fixing issues; long- and short-term work.","Retains accountability until problem fully resolved."],"exampleCriteria":null}]},{"name":"knowledge","title":null,"content":[{"level":1,"criteria":["Knows what they need to do their role, knows who to go to if they don't know something.","Proactivley seeks out the information they need to solve a problem.","Consistently striving to learn more."],"exampleCriteria":null},{"level":2,"criteria":["Go to person within the team on their area. Team defaults to their opinion where there is uncertainty.","Knows which areas they know the best and proactively advises on these areas in team discussions and planning","Works to increase their and their team's knowledge in these areas"],"exampleCriteria":null},{"level":3,"criteria":["Go to expert within company, e.g. invited to give opinion at C Suite meetings.","Understands technical proposals within their area and the business implications of these.","Works to increase company knowledge in multiple areas."],"exampleCriteria":null},{"level":4,"criteria":["Works to increase industry knowledge in their core area.","A key commentator on the industry, e.g. invited to give opinion at external committees, publishes blogs and disseminates knowledge to team.","Challenges proposed solutions in order to get to better ones. Comfortable challenging technical proposals within their area.","Constantly teaching and looking for new ways to share knowledge and skills with others."],"exampleCriteria":null},{"level":5,"criteria":["Contantly innovating, learning and teaching and looking for new ways to do things which haven't been done before. Shares these new ways of doing things internally and externally. Is a recognised industry expert outside of Monzo.","Comfortable creating optimal technical proposals within their area of expertise."],"exampleCriteria":null}]}]}},"genericData":{"html":"","frontmatter":{"path":"/generic","title":"📄 Generic Framework","sidebarTitle":"📄 Generic","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"priorize-simplifique","title":"💥 Priorize e Simplifiquee","content":[{"level":1,"criteria":["Trabalha de forma independente em tarefas pequenas, de menor complexidade e bem definidas","Procura otimizar o trabalho existente (por exemplo, processos, procedimentos, produtos, etc.)","Trabalha de acordo com a urgência e priorização estabelecida"]},{"level":2,"criteria":["Realiza com qualidade tarefas e projetos que estão sob sua responsabilidade","Consegue determinar o impacto relativo e a urgência de tarefas individuais"]},{"level":3,"criteria":["Identifica novos problemas a serem resolvidos, dentro e fora de sua área","Implementa soluções para problemas identificados","Ajuda os outros a identificar e priorizar tarefas"]},{"level":4,"criteria":["Tem uma visão de longo prazo e define blocos de construção para chegar no objetivo","Determina e discute sobre projetos ou tarefas focar primeiro","Melhora a gestão da carga de horário de trabalho apoiando os outros no estabelecimento de prioridades"]},{"level":5,"criteria":["Compreende a visão geral e integra os objetivos da empresa em sua área","Garante que os projetos relevantes da empresa obtenham os recursos adequados","Gerencia vários projetos paralelos e estabelece prioridades de acordo com as necessidades do negócio"]},{"level":6,"criteria":["É o executivo responsável por projetos de alto impacto","Prioriza e equilibra os projetos considerando se é de curto, médio e longo prazo","Expressa opinião sobre as prioridades e colabora com os outros líderes sênior para determinar a importância das questões levantadas na organização."]}]},{"name":"ideias","title":"🧠 Ideias valem mais do que cargos","content":[{"level":1,"criteria":["Demonstra vontade de aprender continuamente","Apoia a criatividade em outros ao ouvir as ideias","Compartilha a própria perspectiva"]},{"level":2,"criteria":["Demonstra curiosidade e sugere mudanças em potencial","Contribui com a geração de ideias","Identifica oportunidades de melhorias dentro da própria função"]},{"level":3,"criteria":["Vê problemas antigos e estado atual em novas maneiras para gerar soluções eficazes","Faz perguntas para estimular o pensamento inovador nos outros","Busca oportunidades e soluções criativas que ajudarão a melhorar o desempenho da equipe"]},{"level":4,"criteria":["Gera novas ideias, métodos, produtos ou soluções continuamente e age sobre novas ideias avaliando e testando os riscos","Incentiva os outros a compartilhar, construir e desafia abertamente as novas ideias uns dos outros"]},{"level":5,"criteria":["Analisa diversas ideias em potencial e avalia cada uma de acordo com as metas do negócio","Aceita falha como uma parte necessária da inovação","Treina os outros para ter perspectivas diferentes, agindo como advogado para novas ideias","Busca novas possibilidades e oportunidades para “manter-se um passo à frente”"]},{"level":6,"criteria":["Assume riscos e visiona o que pode não existir hoje e colabora com os outros para gerar estratégias e dar vida a novas visões","Incentiva os outros a experimentar e aprender com o erro","Busca oportunidades e áreas de negócio onde soluções criativas ajudarão a melhorar a produtividade"]}]},{"name":"historias","title":"💬 Um milhão de Histórias","content":[{"level":1,"criteria":["Comunica ativamente o que eles estão trabalhando","Realiza as tarefas necessárias de modo consistente e confiável para atender as expectativas do cliente","Procura feedback"]},{"level":2,"criteria":["Pode entregar seu trabalho para sua equipe e outros","Fornece feedback proativamente àqueles com quem trabalha","Faz as perguntas certas e ouve diretamente os clientes para obter um entendimento de suas necessidades"]},{"level":3,"criteria":["Comunica-se claramente ao longo da implementação de soluções","mostra-se interessado no cliente ao tentar entender suas preocupações e questões","Desenvolve relacionamentos positivos com os clientes internos e externos"]},{"level":4,"criteria":["Comunica o papel da sua área dentro da missão maior da empresa","Toma medidas adicionais para prever as necessidades dos clientes e age imediatamente para solucionar problemas","Descobre as necessidades ocultas dos clientes e incentiva os outros a considerar o ponto de vista do cliente na tomada de decisão"]},{"level":5,"criteria":["Comunica a visão e missão de longo prazo para a empresa e sua área","Transforma as necessidades dos clientes em ofertas de serviços relevantes","Está sempre atento aos feedbacks de satisfação dos clientes e incorpora esses feedbacks em planos de ação"]},{"level":6,"criteria":["Um comunicador eficaz e inspirador, interna e externamente","Busca compreender os principais atores de negócios dos clientes atuais e potenciais, e projeta as soluções de acordo","Cria e apoia programas de suporte que melhoram a reputação da empresa"]}]},{"name":"seu-problema-meu-problema","title":"🤝 Seu problema, meu problema","content":[{"level":1,"criteria":["Realiza tarefas e responsabilidades específica, fornecendo informações aos outros","Trabalha de modo colaborativo com os membros da equipe para realizar bem o próprio trabalho","Mostra-se disponível a ajudar e colaborar com o trabalho do outro membro da equipe para o bem do coletivo"]},{"level":2,"criteria":["Colabora dentro de sua equipe. Reconhece os papéis dos membros da equipe e como o próprio papel contribui para as metas em comum","Compartilha informações com outros de modo oportuno, oferece suporte aos outros sempre que possível"]},{"level":3,"criteria":["Colabora com membros de outras equipes, estabelecendo e aumentando os relacionamento de trabalho","Busca e incentiva ideias diferentes e diversas dos outros","Capacita os que estão ao seu redor"]},{"level":4,"criteria":["Ensina formal e informalmente aqueles que os rodeiam","Comunica-se dentro e entre equipes para remover barreiras","É reconhecido pelo seu impacto na cultura de equipe e as pessoas querem trabalhar com você"]},{"level":5,"criteria":["Treina os outros para encontrar a melhor solução","Inspira sua equipe e pode atrair os melhores talentos para a organização","Gera cooperação entre equipes","Motiva os membros da equipe e promove os valores da companhia"]},{"level":6,"criteria":["Líder da cultura e estratégia de negócios","Liderança forte e habilidades de coaching","Estabelece uma rede ativa de compartilhamento de informações","Busca e constrói relacionamentos pela organização"]}]},{"name":"resultado","title":"👩‍💻 Foco em Resultado","content":[{"level":1,"criteria":["Trabalha com tarefas pré-determinadas e é focado em suas entregas","Conclui as medidas necessárias para atingir as metas de trabalho","Mantém contato frequente com o gestor imediato para demonstrar o progresso do resultado"]},{"level":2,"criteria":["Estabelece metas individuais que expandem as próprias capacidades","Demonstra o senso de urgência adequado para atingir as metas","É persistente, permanecendo focado para entrega dos resultados","Busca auxílio para escolher ações corretivas a fim de garantir os próprios resultados"]},{"level":3,"criteria":["Inicia e apoia ações para o alcance das metas","Mantém o compromisso apesar dos obstáculos e se esforça para terminar o que começou","Rastreia resultados chave e processos para avaliar o sucesso da equipe e toma medidas corretivas se necessário"]},{"level":4,"criteria":["Busca progressivamente metas e responsabilidades de curto e longo prazo mais desafiadoras","Demonstra energia e resposta positiva ao resolver problemas desafiadores, vendo tarefas complicadas como incentivadoras ou inovadoras","Garante que as metas sejam atingidas ao rastrear continuamente os resultados"]},{"level":5,"criteria":["Colabora com outros líderes para estabelecer metas","Reconhece e recompensa a conquista de resultados diante de desafios e contratempos","Reforça os comportamentos que levaram a superar as expectativas"]},{"level":6,"criteria":["Cria uma visão atraente e estabelece metas de curto, médio e longo prazo","Promove uma cultura voltada a feedback onde os colaboradores falem abertamente sobre seu progresso e sigam na direção do alcance das metas","Monitora e comunica regularmente as conquistas reconhecendo os colaboradores","Avalia os resultados chave e redireciona os esforços, se necessário, para alcançar os resultados"]}]}]}}},"pageContext":{"isYaml":true}}