{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"ab2fc3ad-63a8-54d6-8452-b2e11b8fbce4","excerpt":"","frontmatter":{"path":"/customer-operations","sidebarTitle":"💬 Customer Operations","sidebarGroup":null}}},{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/generic","sidebarTitle":"📄 Generic","sidebarGroup":null}}},{"node":{"id":"7c71a2d0-c97e-5ae1-b734-fd523126ddc2","excerpt":"","frontmatter":{"path":"/executive-support","sidebarTitle":"👭 Executive Support","sidebarGroup":null}}},{"node":{"id":"a900e3df-fe25-5284-8846-c75082303ee0","excerpt":"","frontmatter":{"path":"/frameworks/people","sidebarTitle":"🙂 People","sidebarGroup":null}}},{"node":{"id":"5a958c66-562b-5c23-9825-e3c811f8125d","excerpt":"","frontmatter":{"path":"/product","sidebarTitle":"🚀 Product","sidebarGroup":null}}},{"node":{"id":"85815cc1-bd90-531f-94ef-78c07a8a52d0","excerpt":"","frontmatter":{"path":"/marketing","sidebarTitle":"🎉 Marketing","sidebarGroup":null}}},{"node":{"id":"1c8bb05e-9d2c-5787-a4a1-e910689d93be","excerpt":"","frontmatter":{"path":"/operations/ops-individual-contributor","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations"}}},{"node":{"id":"e7761c75-cd74-588d-82f3-89d80b4101d4","excerpt":"","frontmatter":{"path":"/operations/ops-leadership","sidebarTitle":"🎯 Leadership","sidebarGroup":"operations"}}},{"node":{"id":"8d7734f6-c8bb-5d36-a044-bba4b2bc3d0d","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of most qualitative and quantitative research methods. What's more important, you know their limitations and when to apply them. You've mastered the art of user testing entirely, and know the…","frontmatter":{"path":"/design/user-research","sidebarTitle":"🎯 User Research","sidebarGroup":"design"}}},{"node":{"id":"6d3dd3de-7d8b-5dc3-b9b4-f7673493693c","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of graphic design (layout, type, colour, iconography) and how to put them into practice. You always base your decisions on solid visual design principles and are proficient using the right…","frontmatter":{"path":"/design/visual-design","sidebarTitle":"🎯 Visual Design","sidebarGroup":"design"}}},{"node":{"id":"ad52b86d-82ef-56c2-bbc4-80682ec88bbb","excerpt":"Level 1KnowledgeYou are early on in your design career but have an educated understanding of the basics of visual (layout, type, colour, iconography) and interaction design (gestalt, Fitt's law, Hick's law, etc.), along with experience using Sketch…","frontmatter":{"path":"/design/product-design","sidebarTitle":"🎯 Product Design","sidebarGroup":"design"}}},{"node":{"id":"f67c172e-4528-5d10-b43f-6bd1bb51dff9","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/data","sidebarTitle":"📊 Data","sidebarGroup":"engineering"}}},{"node":{"id":"f05f09d7-d2a5-5eb8-b020-37b5f6ccfa59","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/web","sidebarTitle":"🌐 Web","sidebarGroup":"engineering"}}},{"node":{"id":"de5aa58c-75f9-51ad-84c1-b8512f59b06a","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️Front-end","sidebarGroup":"engineering"}}},{"node":{"id":"adb3e47c-a965-5f39-bf8c-b71ee096ebd5","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/back-end","sidebarTitle":"🛠️Back-end","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"🛠️Mobile","sidebarGroup":"engineering"}}}]},"pageData":{"html":"","frontmatter":{"path":"/product","title":"🚀 Product Framework","sidebarTitle":"🚀 Product","sidebarGroup":null,"yaml":true,"levels":5,"homepage":false,"topics":[{"name":"problem solving","title":"🧠 Problem solving","content":[{"level":1,"criteria":["Assesses if features they are involved with are needed, how it solves customer problems and how it contributes to a measurable business objective.","Demonstrates enthusiasm to learn a range of problem-solving techniques and practices.","Understands how product works in their squad, which problems it solves and how it is performing."],"exampleCriteria":null},{"level":2,"criteria":["Works with the squad to set clear goals for their remit.","Identifies assumptions and risks, and tackles them upfront, testing and learning in increments.","Uses or fosters creativity and experimentation to find and solve problems.","Considers which features to remove, as well as maintain.","Learns from failure and success. Shares and builds on that learning.","Asks good questions to get to the root of a problem or opportunity.","Deep understanding of product in their squad and good knowledge of product in team."],"exampleCriteria":null},{"level":3,"criteria":["Defines a clear, compelling and ambitious product vision and strategy for their remit. Strategy leads to high-performing product experience that delights users.","Proactively identifies and resolves potential problems. Can employ the right (one of many approaches) for the product and problem.","Deep understanding of product in their team and broad knowledge of overall product."],"exampleCriteria":null},{"level":4,"criteria":["Successfully leads initiatives with high levels of uncertainty, from discovery to successful adoption or retirement.","Brings structure, clarity and new insights to ambiguous or complex problems. Can often find ways to make it possible to ‘do both’ by reframing problem or approach."],"exampleCriteria":null},{"level":5,"criteria":["Creates a clear, compelling and ambitious product vision and strategy for the group, drawing from a deep understanding of quantitative and quantitive insight, business objectives and potential.","Creates coherence across their product area and the entire product, aligning and amplifying effort of their squads.","Acknowledged as primary expert on product in their group or field. Expert on a number of frameworks, approaches and able to help PMs understand when and why to adopt certain techniques, their advantages and limitations."],"exampleCriteria":null}]},{"name":"user-centricity","title":"🙍 User-centricity","content":[{"level":1,"criteria":["Always starts with user needs and acts as the voice of the user within their squad.","Able to translate needs into user stories/jobs to be done. Ensures that anything shipped meets users needs. Understands the fidelity needed for different stages of rollout."],"exampleCriteria":null},{"level":2,"criteria":["Can identify who users are and what their needs are, based on evidence. Regularly engages with users and can carry out usability testing unassisted.","Creates shared context and understanding of user needs in their squad. Helps their squad to identify and solve user problems, instead of jumping to features. Ensures that solutions to problems are delightful and high quality."],"exampleCriteria":null},{"level":3,"criteria":["In depth knowledge of current and potential users. Manages trade-offs between user needs.","Ensures their area of the product delights their intended audiences and forms a coherent experience with other features.","Champions users and a user-centred approach with stakeholders."],"exampleCriteria":null},{"level":4,"criteria":["Is a champion for user experience and starting with user needs - helps senior stakeholders and team members to understand the value of this approach.","Can balance trade offs (or think creatively to increase the pie) between user need and business need."],"exampleCriteria":null},{"level":5,"criteria":["Ensures the overall product experience is of extraordinary quality and really meets user’s needs."],"exampleCriteria":null}]},{"name":"data skills","title":"👨‍💻 Data Skills","content":[{"level":1,"criteria":["Closely tracks metrics for features. Uses them to spot issues and measure success.","Understands how squad’s work links to business objectives and key performance indicators."],"exampleCriteria":null},{"level":2,"criteria":["Collaborates with product analyst to set up the right things to track. Understand what a metric actually measures and how reliable/direct it is.","Closely tracks performance of their squad, and how to influence it. Draws reliable conclusions from qualitative and quantitative data."],"exampleCriteria":null},{"level":3,"criteria":["Closely tracks and understands how metrics interact with and impact other group/business metrics.","Identifies when and how to set experiments, supported by a product data analyst. Incorporates results into future iterations.","Can assimilate new information easily, and can synthesise qualitative and quantitative inputs to form reliable insights into user needs and behaviour."],"exampleCriteria":null},{"level":4,"criteria":["Makes data-driven decisions based on a multitude of complex, interdependent factors.","Can design and evaluate experiments, based on solid hypotheses. Proactively alters course when confidence of hitting goals is low."],"exampleCriteria":null},{"level":5,"criteria":["Connects squad and group numbers to success metrics of business, recognises and addresses gaps between the impact of individual KPIs and business goals.","Deeply understands a range of research and analysis methods, identifies which are best for a given situation and can coach on their use."],"exampleCriteria":null}]},{"name":"domain knowledge","title":"💭 Domain Knowledge","content":[{"level":1,"criteria":["Understands and appreciates the appropriate use of HTML, CSS, JS and native code.","Demonstrates appetite and aptitude to learn about the context the product operates in."],"exampleCriteria":null},{"level":2,"criteria":["Understands core principles of web technologies, including HTTP(S)-based interactions between front-end clients and back-end servers/microservices and APIs.","Understands the need to consider, and takes, expert advice. Applies the concepts correctly and demonstrates a strong interest in their area."],"exampleCriteria":null},{"level":3,"criteria":["Understands how code is tested, deployed and version-controlled for backend microservices, native apps and web interfaces.","Develops and maintains solid foundation of market knowledge in their area, proactively identifies potential issues/risks."],"exampleCriteria":null},{"level":4,"criteria":["Conversant with overall Monzo architecture, and highly knowledgeable about specific elements and services that are relevant to their area of responsibility.","Develops and maintains an in-depth market knowledge in at least one area and is able to challenge experts. Identifies market opportunities or product gaps."],"exampleCriteria":null},{"level":5,"criteria":["Well-informed about relevant technology advances, and how newer approaches/interfaces could be used to solve specific user problems.","Deep market knowledge within several key areas related to their group and wider business."],"exampleCriteria":null}]},{"name":"execution","title":"🛠️ Execution","content":[{"level":1,"criteria":["Can prioritise defined tasks based on effort, impact, user needs and business goals."],"exampleCriteria":null},{"level":2,"criteria":["Tends to action - narrowing in on a MVP to help learn. Comfortable with releasing uncomfortable first versions (done is better than perfect).","Leads squad in prioritising work with some ambiguity or competing demands.","Makes sure the team have everything they need to be productive.","Maintains sensible work in progress limits and knows when and how to say no."],"exampleCriteria":null},{"level":3,"criteria":["Able to prioritise effectively on multiple dimensions - makes sure the urgent doesn’t always outdo the important; that there is a balance between new work, maintenance, fixing issues; long- and short-term work.","Employs speed as a habit."],"exampleCriteria":null},{"level":4,"criteria":["Creates frameworks that aid decision making and prioritisation."],"exampleCriteria":null},{"level":5,"criteria":["Makes successful trade offs in areas of extreme risk, complexity and uncertainty.","Coaches PMs in their area on effective and balanced prioritisation."],"exampleCriteria":null}]},{"name":"works through others","title":"🤝 Works Through Others","content":[{"level":1,"criteria":["Collaborates daily with members of the product squad to ship and iterate.","Understands the objectives of and participates actively in team ceremonies. Prepared and organised to make the most of squad time."],"exampleCriteria":null},{"level":2,"criteria":["Sets squad rhythm and routines - facilitates agreement on how they all work together to discover, define and ship features or experiments to meet their goals.","Works collaboratively to get the best out of all of the people in their squad, involving all disciplines throughout. Takes proactive steps to build and maintain team health, e.g. resolve conflict, counter inertia.","Point person for the squad - does whatever is needed to unblock or support the squad and their delivery. Escalates and delegates appropriately.","Ensures the squad has the skills and resources it needs to ship autonomously."],"exampleCriteria":null},{"level":3,"criteria":["Servant leader who empowers the squad to achieve more and be ambitious (test sooner, generate more ideas, think broadly), valuing outcome over output.","Ensures the squad are aware of what other squads are working on and how that relates to their squad’s goals.","Coaches Associate Product Managers and helps them identify and achieve personal development goals."],"exampleCriteria":null},{"level":4,"criteria":["Understands how the needs of the team vary across product and team lifecycle and adapts accordingly.","Open to being challenged, encourages constructive conflict and maximises the talent of others. Makes the squad “missionaries, not mercenaries”."],"exampleCriteria":null},{"level":5,"criteria":["Creates understanding in squads of how their work links to other teams’ work, business goals and the market.","Ensures strong product and team health, and an environment of psychological safety.","Can resolve disputes or head off team performance issues through mediation, negotiation and coaching.","Identifies and mentors high potential Product Managers and APM candidates.","Ensures we have the teams, practices and infrastructure in place to successfully execute strategy.","Minimises dependencies between groups and removes systemic blockers to speed and quality. Incentivises breaking down problems, idea generation and shipping the smallest thing to learn what’s needed quickly."],"exampleCriteria":null}]},{"name":"feedback","title":"👪 Feedback","content":[{"level":1,"criteria":["Seeks out the information they need to solve a problem.","Keeps stakeholders like COps, legal, marketing, finance updated on progress and ensures they have what they need.","Able to clearly articulate what we’re working on and why."],"exampleCriteria":null},{"level":2,"criteria":["Proactively communicates with users, squads and stakeholders.","Identifies assumptions, shares direction and tailors communication to audience.","Seeks out and gives constructive, actionable feedback where valuable."],"exampleCriteria":null},{"level":3,"criteria":["Can gather influence and support for their work, confidently debating and defending their decisions and approach.","Communicates effectively to a wide range of stakeholders, e.g. sharing update with ExCo/all hands or community."],"exampleCriteria":null},{"level":4,"criteria":["Ensures the team has strong relationships with stakeholders, fully recognises their constraints and concerns and creates mutual recognition and trust.","Able to simply explain complex concepts and deliver difficult messages clearly."],"exampleCriteria":null},{"level":5,"criteria":["Articulates and unites a team behind a clear and compelling product vision, mission and strategy, along multiple time horizons."],"exampleCriteria":null}]}]}},"genericData":{"html":"","frontmatter":{"path":"/generic","title":"📄 Generic Framework","sidebarTitle":"📄 Generic","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"knowledge","title":"🧠 Knowledge","content":[{"level":1,"criteria":["Learning just as much as adding value","Has enough knowledge to make informed decisions","Doesn’t necessarily know what they don’t know"]},{"level":2,"criteria":["Identifies areas/subjects they don’t know and proactively seeks out knowledge","Increased domain knowledge","Aware of their weaknesses"]},{"level":3,"criteria":["Additional expertise or breadth of knowledge"]},{"level":4,"criteria":["Has depth of knowledge in a particular area and breadth of knowledge across their domain","You know who the experts are and delegate accordingly"]},{"level":5,"criteria":["Wide breadth of knowledge","Can easily context switch within their area and pick up new concepts"]},{"level":6,"criteria":["Has a high-level understanding of all the areas they own","Understands the wider business context"]}]},{"name":"impact","title":"💥 Impact","content":[{"level":1,"criteria":["Independently works on small, low-impact, well-defined task","Looks to optimise existing work (eg Processes, procedures, products, etc)"]},{"level":2,"criteria":["Delivers small, well-defined tasks/projects","Delegated low-impact problems to solve"]},{"level":3,"criteria":["Identifies problems to solve","Owns the implementation of the solution"]},{"level":4,"criteria":["Can take a long-term vision and define building blocks to get there"]},{"level":5,"criteria":["Understands the big picture and integrates company goals into their area"]},{"level":6,"criteria":["Is the accountable exec for high-impact projects"]}]},{"name":"communication","title":"💬 Communication","content":[{"level":1,"criteria":["Actively communicates what they are working on","Seeks out feedback"]},{"level":2,"criteria":["Can deliver their work to their team and others","Proactively gives feedback to those they work with"]},{"level":3,"criteria":["Clearly communicates throughout implementation of solutions","Can successfully get buy-in for their proposals"]},{"level":4,"criteria":["Communicates their area’s role within the larger mission of the company"]},{"level":5,"criteria":["Communicates the long-term vision & mission for the company and their area"]},{"level":6,"criteria":["An effective and inspiring communicator internally and externally"]}]},{"name":"teamwork","title":"🤝 Teamwork","content":[{"level":1,"criteria":["Works closely or in pairs with more senior members of the team when facing tasks for the first time","Needs support and guidance from managers, mentors and leads","Needs approval to ship projects of a certain impact","They may need support on how to navigate the professional environment"]},{"level":2,"criteria":["Starts to delegate tasks to peers","Collaborates within their team","Independently works and learns","Do not need to be checked in on daily"]},{"level":3,"criteria":["Collaborates across the organisation","Strong cultural understanding","Empowers those around them","Takes ownership of their own development"]},{"level":4,"criteria":["Leads through influence","Natural teacher, they’re able to formally and informally teach those around them","You unblock people within your area","You’re recognised for your impact on team culture and people want to work with you"]},{"level":5,"criteria":["You coach others to find the best solution","You inspire your team and can attract top talent to the organisation","You unblock people outside of your area"]},{"level":6,"criteria":["Leader of business culture and strategy","You own your area’s structure","Strong leadership and coaching abilities"]}]},{"name":"conduct","title":"👩‍💻 Conduct","content":[{"level":1,"criteria":["Follows policies and procedures applicable to role","Completes training","Identifies risks related to own areas"]},{"level":2,"criteria":["Applies and follows governance principles as they apply to role","Communicates and escalates risks related to own projects and business area","Ensures colleagues actively analyse and address risks in their area"]},{"level":3,"criteria":["Expert risk and compliance knowledge as relevant to role","Takes ownership for training others in risk & compliance as relevant to their role","Promptly and effectively deals with unforeseen risks as they arise"]},{"level":4,"criteria":["Uses knowledge of internal and external environment to develop strategy and internal policy","Applies sophisticated and creative analysis and recommends remediating action","Responds to complex issues devising smart strategies for the mitigation of risk"]},{"level":5,"criteria":["Participates in risk management and mitigation at the highest industry level","Leads by example and proves their area is managing risk and compliance within appetite","Gets involved in and identifies opportunities for colleagues to participate in advisory, strategic, industry bodies to learn and share best practice in their area of business"]},{"level":6,"criteria":["Creates a strong risk culture throughout the organisation","Owns policies and can evidence their compliance","Contributes to thought leadership on effective and creative risk management throughout the industry","Proactively identifies holistic measures to robust risk management and implements them company-wide"]}]}]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"isYaml":true}}