{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/progressao-generica","sidebarTitle":"📄 Progressão Genérica GetNinjas","sidebarGroup":"generic"}}},{"node":{"id":"adb3e47c-a965-5f39-bf8c-b71ee096ebd5","excerpt":"Sobre nosso framework de progressão de engenhariaO framework de progressão de engenharia no GetNinjas é uma ferrementa que ajuda pessoas engenheiras e de gestão a:fazer desenvolvimento e plano de carreira;conversar sobre o que nós buscamos das…","frontmatter":{"path":"/engineering/back-end","sidebarTitle":"🛠️ Back-end","sidebarGroup":"engineering"}}},{"node":{"id":"7bee2609-6bc3-522f-abeb-e751decf8cd2","excerpt":"Sobre nosso framework de progressão de engenhariaO framework de progressão de engenharia no GetNinjas é uma ferrementa que ajuda pessoas engenheiras e de gestão a:fazer desenvolvimento e plano de carreira;conversar sobre o que nós buscamos das…","frontmatter":{"path":"/engineering/platform-engineer","sidebarTitle":"🛠️ Platform Engineer","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"Sobre nosso framework de progressão de engenhariaO framework de progressão de engenharia no GetNinjas é uma ferrementa que ajuda pessoas engenheiras e de gestão a:fazer desenvolvimento e plano de carreira;conversar sobre o que nós buscamos das…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"🛠️ Mobile","sidebarGroup":"engineering"}}},{"node":{"id":"de5aa58c-75f9-51ad-84c1-b8512f59b06a","excerpt":"Sobre nosso framework de progressão de engenhariaO framework de progressão de engenharia no GetNinjas é uma ferrementa que ajuda pessoas engenheiras e de gestão a:fazer desenvolvimento e plano de carreira;conversar sobre o que nós buscamos das…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️ Front-end","sidebarGroup":"engineering"}}}]},"pageData":{"html":"<h3>Sobre nosso framework de progressão de engenharia</h3>\n<p>O framework de progressão de engenharia no GetNinjas é uma ferrementa que ajuda pessoas engenheiras e de gestão a:</p>\n<ul>\n<li>fazer desenvolvimento e plano de carreira;</li>\n<li>conversar sobre o que nós buscamos das pessoas de engenharia num caminho consistente;</li>\n<li>ter um nível justo de compensação financeira.</li>\n</ul>\n<p>O framework é um um compasso, não um GPS.</p>\n<p>Isso significa ser um auxiliar. Não significa que é um sistema de avaliação pra humanos, livres de casos específicos ou diferentes do comum.</p>\n<h3>Como funciona?</h3>\n<p>O framework cobre todas as coisas que nós buscamos em pessoas de engenharia no GetNinjas. Colocamos nosso interesse em esse número de competências técnicas:</p>\n<ul>\n<li>Troubleshooting;</li>\n<li>Testes e Ferramentas de Teste;</li>\n<li>Programação e Linguagens;</li>\n<li>Infraestrutura (AWS/Cloud);</li>\n<li>Evolução dos Sistemas;</li>\n<li>Arquitetura;</li>\n</ul>\n<p>Nós organizamos em 5 níveis, e tentamos dar exemplos específicos de comportamentos que nós esperamos pra cada um dos níveis. Cada um desses níveis tem uma faixa salarial justa associada.</p>\n<p>A pessoa que é líder irá trabalhar nisso com você. Nada disso irá acontecer misteriosamente por trás dos panos. Você i'ra concordar em qual nível de progressão você está indo e o que precisa pra melhorar junto com quem é líder seu(sua). Deve ser claro como você está fazendo algo relativo com o nível, todas as vezes que falarem sobre.</p>\n<h3>Coisas pra ter em mente</h3>\n<ul>\n<li>\n<p>Há muitas formas de progredir e ser avaliado no GetNinjas enquanto você vai crescendo, incluindo conhecimento técnico profundo e habilidade, liderança técnica e gestão de pessoas. Todos são avaliados de forma igual no nosso time;</p>\n</li>\n<li>\n<p>O framework representa o valor de progressão de um carreira, as pessoas não deveriam experar um super vôo em 18 meses!</p>\n</li>\n<li>\n<p>Progressão de engenharia não é uma ciência exata e sempre será um pouco ambígua</p>\n</li>\n<li>\n<p>Engineering progression isn’t an exact science and there will always be some ambiguity.</p>\n</li>\n<li>\n<p>Isso não é uma checklist - é possível progredir pra um nível sem mostrar todos os comportamentos daquele nível;</p>\n</li>\n<li>\n<p>Existem mais níveis altos (6 e 7 pra cada competência), mas nós não adicionaremos agora, isso até que nós precisemos deles.</p>\n</li>\n<li>\n<p>Esse framework não está escrito em pedra. Se você tiver sugestões de melhorias ou dúvidas, por favor não deixe de pontuar com a liderança.</p>\n</li>\n</ul>","frontmatter":{"path":"/engineering/mobile","title":"🛠️ Mobile Engineering Framework","sidebarTitle":"🛠️ Mobile","sidebarGroup":"engineering","yaml":true,"levels":5,"homepage":true,"topics":[{"name":"testes","title":"Testes e Ferramentas de Teste","content":[{"level":1,"criteria":["Não conhece tipos de teste que existem ou a diferença entre eles","Não conhece ou não usa ferramentas de testes","Não conhece ou não sabe implementar ferramentas de CI"]},{"level":2,"criteria":["Já conhece os tipos de teste e sabe usa-los em diferentes cenários","Conhece e já usa uma ou outra ferramenta de teste","Sabe como funciona um CI e usar o log em favor dos testes","Conhece metodologias de testes como TDD, BDD, entre outras"]},{"level":3,"criteria":["Entende a necessidade de coverage de código com testes, sejam de unidade ou de integração","Usa mais de uma ferramenta de teste e sabe qual é ideal pra cada tipo de projeto","Consegue configurar um CI e como aplica-lo ao pipeline do build das aplicações","Sabe quando usar uma metodologia de testes (ex: TDD, BDD, etc.)"]},{"level":4,"criteria":["Sugere criação de novos tipos de testes (aceitação, unitário, integração, etc.) que ainda não usamos nos apps e que faça sentido","Aplica métodos de coverage nas aplicações, pra descobrir o quanto temos cobertura do nosso código, e usar no nosso pipeline de CI","Sabe construir um CI do zero, configurando e ajustando ao pipeline"]},{"level":5,"criteria":["Dissemina conhecimento entre os times sobre novos padrões e tipos de testes","Faz análises de coverage de código, traz novas ferramentas de testes e ensina os times como usá-las","Domina o processo de testes automatizados sejam eles num CI ou localmente. Propõe novas estruturas de testes diferentes das que usamos"]},{"level":6,"criteria":["É referência em testes na empresa e toma a frente de problemas multi-times relacionados a testes","Puxa discussões sobre qualidade nos testes, liderando iniciativas de aplicação de novas ferramentas de coverage","Lidera movimentação de novas tecnologias de testes e ajuda a construi-las, sendo responsável por mantê-las"]},{"level":7,"criteria":["Cria novos padrões de testes, usando conhecimento da comunidade e discute novas tecnologias de teste na empresa ou fora dela","Cria novas tecnologias de coverage ou utiliza um combinado delas pra resolver problemas de testes","Lidera quaisquer discussões sobre teste e é referência quando alguém precisa de ajuda em problemas de alto nível de testes"]}]},{"name":"programacao","title":"Programação e Linguagens","content":[{"level":1,"criteria":["Não conhece nenhuma linguagem de programação ou não tem experiência em usa-la no dia-a-dia","Não conhece ou nunca utilizou na prática algoritmos","Não sabe paradigmas de linguagens (ex: procedural, orientada a objetos, funcional)","Não sabe sobre padrões de código ou qualidade"]},{"level":2,"criteria":["Está iniciando em uma linguagem de programação e começando a usa-la no dia-a-dia","Conhece alguns algoritmos e sabe aonde usa-los (ex: binary search)","Conhece no mínimo um paradigma de linguagem, principalmente o que usa no dia-a-dia (ex: procedural, orientada a objetos, funcional)","Começou a estudar e usar padrões de código e de qualidade"]},{"level":3,"criteria":["Já tem um bom conhecimento da linguagem que trabalha, e usa os conceitos intermediários das mesmas pra resolver problemas","Usa algoritmos pra solucionar problemas do dia-a-dia, mesmo que de forma indireta","Conhece paradigmas diferentes das linguagens e usa, quando necessário, pra resolver problemas de negócio nossos","Usa padrões de código e de qualidade da empresa sem maiores problemas"]},{"level":4,"criteria":["Tem excelente conhecimento sobre linguagens que trabalha e conhece as entranhas da linguagem, usando-as a seu favor no dia-a-dia","Conhece algoritmos, sugere usar nos problemas que temos","Aplica paradigmas diferentes nas nossas aplicações e sugere uso desses novos paradigmas constantemente, principalmente quando resolvem problemas de produto nossos","Sugere novos padrões de código e aplica nos projetos que trabalha"]},{"level":5,"criteria":["Puxa iniciativas de movimentação ou adoção de novas linguagens nos sistemas","Lidera resolução de problemas usando linguagens como fator decisivo em melhorias","Consegue explicar e justificar o uso de novos paradigmas pra qualquer pessoa do time, mostrando as vantagens e desvantagens do uso de tais paradigmas para resolução de problemas nossos","É a referência do time nas discussões sobre diferentes linguagens de programação e as boas práticas de cada uma"]}]},{"name":"troubleshooting","title":"Troubleshooting","content":[{"level":1,"criteria":["Não tem nenhum conhecimento sobre debugging","Não sabe como atuar em bug fixes","Não acompanha métricas das aplicações"]},{"level":2,"criteria":["Está aprendendo téncicas de debugging e ferramentas","Está descobrindo as melhores formas de aplicar bug fixes","Aos poucos usa as métricas de aplicações (ex: uso de cpu, número de erros, etc.) a seu favor"]},{"level":3,"criteria":["Usa ferramentas de debugging no dia-a-dia","Faz bug fixes e corrige problemas recorrentes das aplicações","Acompanha métricas constantemente e identifica possíveis problemas através delas"]},{"level":4,"criteria":["Cria novas iniciativas ou novas ferramentas pra debugging","É referência para os times quando há um erro muito difícil de ser explicado, sabendo como resolve-lo","Cria ou implementa novos formatos de métricas de erros, não comuns no mercado, sejam de aplicação ou de infraestrutura"]},{"level":5,"criteria":["Lidera iniciativas para melhorias de ferramentas de debugging","Resolve bugs muito específicos, intrínsecos das linguagens e ferramentas que trabalha","Consegue criar ou trazer novas técnicas de descoberta de erros, através de métricas ou de ferramentas específicas"]}]},{"name":"infraestrutura","title":"Infraestrutura","content":[{"level":1,"criteria":["Não tem nenhum conceito sobre serviços","Não sabe como subir uma aplicação em um ambiente de cloud","Não conhece ferramentas de automação de infraestrutura ou cloud","Não conhece e nem utiliza o conceito em container nas aplicações que trabalha","Não tem conhecimento sobre a metodologia 12-Factor App"]},{"level":2,"criteria":["Não tem nenhum conceito sobre serviços","Não sabe como subir uma aplicação em um ambiente de cloud","Não conhece ferramentas de automação de infraestrutura ou cloud","Não conhece e nem utiliza o conceito em container nas aplicações que trabalha","Não tem conhecimento sobre a metodologia 12-Factor App"]},{"level":3,"criteria":["Tem conhecimento básico de alguns serviços unix (ex: df, ps, kill, cat, tail, head)","Sabe como funciona o processo de deploy de uma aplicação","Usa, de forma simples, algumas ferramentas de automação de infraestrutura, como terraform entre outras","Conhece e utiliza o conceito em containers nas aplicações que trabalha","Conhece a metodologia 12-Factor App"]},{"level":4,"criteria":["Tem conhecimento básico de alguns serviços unix (ex: df, ps, kill, cat, tail, head)","Sabe como funciona o processo de deploy de uma aplicação","Usa, de forma simples, algumas ferramentas de automação de infraestrutura, como terraform entre outras","Conhece e utiliza o conceito em containers nas aplicações que trabalha","Conhece a metodologia 12-Factor App"]},{"level":5,"criteria":["Sabe sugerir, configurar e fazer um troubleshooting (analisar log) de determinados serviços (ex: nginx, mysql, mongo, redis)","Sugere e aplica melhorias nos processos de deploy","Tem conhecimento suficiente pra lidar com infra-as-code","Usa containers nas aplicações que trabalha e sugere novas formas de usa-los em problemas de infra-estrutura nossos","Implementa os fatores contidos na metodologia 12-Factor App"]}]},{"name":"evolucao","title":"Evolução dos Sistemas","content":[{"level":1,"criteria":["Nunca teve experiência em refactor de sistemas","Não tem ideia de como fazer evoluções nas aplicações","Não sabe como lidar com sistemas legados"]},{"level":2,"criteria":["Está começando a fazer alguns refactors em sistemas","Conhece uma ou outra técnica de refactoring","Lida com sistemas legados, mas ainda está aprendendo a como melhorar os mesmos"]},{"level":3,"criteria":["Já faz refactors com uma certa frequência nos sistemas que trabalha","Usa técnicas de refactoring pra resolver problemas (ex: extração de métodos)","Faz melhorias nos sistemas legados no dia-a-dia"]},{"level":4,"criteria":["Toma a frente de refactors de sistemas no time que atua","Frequentemente usa métodos de refactoring e tem ótimos conceitos a respeito de como fazer essas melhorias","Planeja, arquiteta e executa melhorias nos sistemas legados"]},{"level":5,"criteria":["Ensina e promove uma cultura de refactor e sua importância nos times","Sabe quando é melhor extrair pra um serviço ou apenas isolar partes da aplicação","Faz melhorias cruciais em sistemas legados, promovendo a saúde constante dos mesmos"]}]},{"name":"arquitetura","title":"Arquitetura","content":[{"level":1,"criteria":["Não conhece nenhum paradigma de arquitetura","Nunca lidou com projetos que envolvia um planejamento de arquitetura","Não sabe a finalidade, restrições, estrutura ou relacionamentos dos sistemas que trabalha"]},{"level":2,"criteria":["Sabe um ou outro conceito de arquitetura, como padrões de comunicação","Participa de definições iniciais de novos sistemas ou de antigos e sabe dialogar sobre o assunto num nível considerável","Sabe explicar estrutura e relacionamentos dos sistemas que trabalha"]},{"level":3,"criteria":["Usa conceitos de arquitetura pra resolver problemas de produto ou inter-sistemas","Ajuda a definir estrutura de novos sistemas e sabe quando usar algum conceito de arquitetura nas discussões","Aplica e modifica estruturas de sistemas, tanto na comunicação, no código ou em seus componentes"]},{"level":4,"criteria":["É a pessoa que conhece conceitos de arquitetura e toma a frente no uso desses conceitos em decisões técnicas","Define novas estruturas de sistemas apresentando propostas de melhorias nas nossas arquiteturas","Cria sistemas que revolucionam conceitos de comunicação, comportamento e organização nossas"]},{"level":5,"criteria":["Ensina e dissemina conhecimento sobre arquitetura dos nossos sistemas para as pessoas novas no time","É sempre procurado pra definição de novas estruturas de sistemas ou discussões sobre novas formas de comunicação entre os mesmos","É a referência de arquitetura do time, sendo a pessoa que ajuda a decidir e criar novos sistemas ou conceitos de arquitetura"]}]}]}},"genericData":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"isYaml":true}}