{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"ab2fc3ad-63a8-54d6-8452-b2e11b8fbce4","excerpt":"","frontmatter":{"path":"/customer-operations","sidebarTitle":"💬 Customer Operations","sidebarGroup":null}}},{"node":{"id":"d3b6b27a-d4df-5f76-b8cb-54972040eac7","excerpt":"","frontmatter":{"path":"/generic","sidebarTitle":"📄 Generic","sidebarGroup":null}}},{"node":{"id":"7c71a2d0-c97e-5ae1-b734-fd523126ddc2","excerpt":"","frontmatter":{"path":"/executive-support","sidebarTitle":"👭 Executive Support","sidebarGroup":null}}},{"node":{"id":"a900e3df-fe25-5284-8846-c75082303ee0","excerpt":"","frontmatter":{"path":"/frameworks/people","sidebarTitle":"🙂 People","sidebarGroup":null}}},{"node":{"id":"5a958c66-562b-5c23-9825-e3c811f8125d","excerpt":"","frontmatter":{"path":"/product","sidebarTitle":"🚀 Product","sidebarGroup":null}}},{"node":{"id":"85815cc1-bd90-531f-94ef-78c07a8a52d0","excerpt":"","frontmatter":{"path":"/marketing","sidebarTitle":"🎉 Marketing","sidebarGroup":null}}},{"node":{"id":"1c8bb05e-9d2c-5787-a4a1-e910689d93be","excerpt":"","frontmatter":{"path":"/operations/ops-individual-contributor","sidebarTitle":"🙋‍♀️ Individual Contributor","sidebarGroup":"operations"}}},{"node":{"id":"e7761c75-cd74-588d-82f3-89d80b4101d4","excerpt":"","frontmatter":{"path":"/operations/ops-leadership","sidebarTitle":"🎯 Leadership","sidebarGroup":"operations"}}},{"node":{"id":"8d7734f6-c8bb-5d36-a044-bba4b2bc3d0d","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of most qualitative and quantitative research methods. What's more important, you know their limitations and when to apply them. You've mastered the art of user testing entirely, and know the…","frontmatter":{"path":"/design/user-research","sidebarTitle":"🎯 User Research","sidebarGroup":"design"}}},{"node":{"id":"6d3dd3de-7d8b-5dc3-b9b4-f7673493693c","excerpt":"Level 1KnowledgeYou understand the theory and fundamentals of graphic design (layout, type, colour, iconography) and how to put them into practice. You always base your decisions on solid visual design principles and are proficient using the right…","frontmatter":{"path":"/design/visual-design","sidebarTitle":"🎯 Visual Design","sidebarGroup":"design"}}},{"node":{"id":"8918b4d3-bb06-5f88-86e3-7fc79eb47f43","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/backend","sidebarTitle":"🛠️ Backend","sidebarGroup":"engineering"}}},{"node":{"id":"ad52b86d-82ef-56c2-bbc4-80682ec88bbb","excerpt":"Level 1KnowledgeYou are early on in your design career but have an educated understanding of the basics of visual (layout, type, colour, iconography) and interaction design (gestalt, Fitt's law, Hick's law, etc.), along with experience using Sketch…","frontmatter":{"path":"/design/product-design","sidebarTitle":"🎯 Product Design","sidebarGroup":"design"}}},{"node":{"id":"f67c172e-4528-5d10-b43f-6bd1bb51dff9","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/data","sidebarTitle":"📊 Data","sidebarGroup":"engineering"}}},{"node":{"id":"d92d711b-069b-5b66-9590-1710413b4bdd","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/mobile","sidebarTitle":"👩‍💻 Mobile","sidebarGroup":"engineering"}}},{"node":{"id":"f05f09d7-d2a5-5eb8-b020-37b5f6ccfa59","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/web","sidebarTitle":"🌐 Web","sidebarGroup":"engineering"}}},{"node":{"id":"4200b31b-2c3c-5af4-ab54-cec5de9a3b37","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️Front-end","sidebarGroup":"engineering"}}},{"node":{"id":"de5aa58c-75f9-51ad-84c1-b8512f59b06a","excerpt":"About our engineering progression frameworksThe engineering progression framework is a tool that helps engineers and managers:make development and career planstalk about what we’re looking for from engineers in a consistent wayset a fair level of…","frontmatter":{"path":"/engineering/front-end","sidebarTitle":"🛠️Front-end","sidebarGroup":"engineering"}}}]},"pageData":{"html":"<h3>About our engineering progression frameworks</h3>\n<p>The engineering progression framework is a tool that helps engineers and managers:</p>\n<ul>\n<li>make development and career plans</li>\n<li>talk about what we’re looking for from engineers in a consistent way</li>\n<li>set a fair level of compensation.</li>\n</ul>\n<p>The framework is a compass, not a GPS.</p>\n<p>It's meant to be helpful. It's not meant to be a rating system for humans, free from edge cases.</p>\n<h3>How does it work?</h3>\n<p>The framework covers all the things we’re looking for from engineers at Monzo. We’re interested in these five elements:</p>\n<ul>\n<li>Mastery - Your Monzo knowledge and technical capability</li>\n<li>Impact - The size, scope and value of what you deliver</li>\n<li>Influence - How you change the world around you for the better</li>\n<li>Comms &#x26; Feedback - How you interact with others</li>\n<li>Leadership - How people around you become better and more impactful</li>\n</ul>\n<p>We sort them into six levels, and we try to give specific examples of behaviours we expect for each. Each of those levels has a fairly wide salary range associated with it, and within each level you can progress in sub-levels, labelled A–E. So even if you’re at level 3 for a couple of years, you’ll still be able to see that you’re moving forward. Basically, the more behaviours you show from your level, the more you’ll progress.</p>\n<p>Your manager will work with you on this. None of it will happen mysteriously behind closed doors. You’ll agree what level of progression you’re going for and what you need to improve on with your manager. It should be clear how you’re doing relative to that at all times.</p>\n<h3>Things to keep in mind</h3>\n<ul>\n<li>There are many different ways to progress and be valuable to Monzo as you grow, including deep technical knowledge and ability, technical leadership and people management. All are equally valuable paths in Monzo's engineering team.</li>\n<li>The framework represents a career’s worth of progression, people shouldn’t expect to fly up it in 18 months!</li>\n<li>Engineering progression isn’t an exact science and there will always be some ambiguity.</li>\n<li>This isn’t a checklist – it’s possible to progress up a level without showing all the behaviours in that level.</li>\n<li>There will be levels on top (eg ‘Inventor of Android’ or ‘Author of Go’), but we won’t add them until we need them.</li>\n<li>You can find some more information in these links. If that doesn't answer most of your questions, please ask your manager.</li>\n</ul>\n<h3>Give us your feedback!</h3>\n<p>This is only the first version of our framework and we really want your feedback.</p>\n<p>We're particularly keen to add as many examples to the behaviours as possible, to further clarify them.</p>","frontmatter":{"path":"/engineering/data","title":"📊 Data Engineering Framework","sidebarTitle":"📊 Data","sidebarGroup":"engineering","yaml":true,"levels":6,"homepage":true,"topics":[{"name":"communication","title":null,"content":[{"level":1,"criteria":["Provides regular status updates to their mentor/buddy","Points out syntactical improvements in code reviews","Writes PR descriptions that provide basic context for the change","Seeks guidance from other engineers, rather than answers"],"exampleCriteria":null},{"level":2,"criteria":["Proactively communicates to their team what they are working on, why, how it's going and what help they need","Accepts feedback graciously","Gives feedback to peers when asked"],"exampleCriteria":[{"criteria":"Provides helpful and actionable feedback in code reviews in an empathetic manner","examples":["Take a look at the levelling up your code reviews talk for some ideas"]},{"criteria":"Writes PR descriptions that provide context and provide rationale for significant decisions","examples":["I decided to X instead of Y here, I also considered Z but for these reasons I went with X"]}]},{"level":3,"criteria":["Transparent about mistakes they've made, early","Proactively gives timely actionable feedback to peers","Proactively seeks feedback from the people around them","Considers the opinions of others before defending their own"],"exampleCriteria":null},{"level":4,"criteria":["Proactively gives feedback 'upwards' and to people they interact with who are not in their team","Transparent in making design and technical decisions","Helps people in non-technical roles understand technical constraints / trade-offs","Shares technical context and direction for less experienced engineers","Gives direct and constructive feedback to other engineers"],"exampleCriteria":null},{"level":5,"criteria":["Helps other people develop themselves and regularly gives insightful, useful feedback to those around them","Talks to non-technical stakeholders on appropriate level of abstraction"],"exampleCriteria":null},{"level":6,"criteria":["Transparent about feedback they have received and what they are going to do differently"],"exampleCriteria":null}]},{"name":"impact","title":null,"content":[{"level":1,"criteria":["Delivers assigned tasks, working with a more senior team member, and able to take PR feedback to improve their work"],"exampleCriteria":null},{"level":2,"criteria":["Delivers assigned tasks that meet expected criteria","Works for the team, focuses on tasks that contribute to team goals","Tries to unblock themselves first before seeking help","Manages their own time effectively, prioritises their workload well, on time for meetings, aware when blocking others and unblocks","Helps the team, does what needs doing","Breaks down small/medium problems into iterative steps"],"exampleCriteria":null},{"level":3,"criteria":["Delivers large well-defined tasks and solves small scope not-well-defined problems","Contributes to writing proposals (Co-authors with more experienced Engineer)","Breaks down large problems into smaller iterative steps across multiple PRs"],"exampleCriteria":null},{"level":4,"criteria":["Solves ambiguous problems","Leads writing small/medium scope proposals","Thrown at fires and resolves / contributes heavily to resolving them","Makes pragmatic choices about taking on tech debt","Considers multiple different solutions for solving a problem","Breaks down projects into smaller iterative steps that each deliver value"],"exampleCriteria":null},{"level":5,"criteria":["Solves the 'hard problem' in a project e.g. Mastercard crypto and sees it through to resolution","Solves larger ambiguous problems","Leads incident resolutions","Makes judgements about when to diverge from the immediate goal to achieve something else","Leading large scale technical infrastructure projects (level 5 would originate or complete, probably)","Leads writing large scope proposals","Breaks down large long-lasting projects into sensible discrete chunks that compound to achieve a large goal","Helps prioritise and balance short-term and long-term investments, focusing on high impact, high value work"],"exampleCriteria":null},{"level":6,"criteria":["Accountable for delivery of large, mission critical engineering projects","Originates or finishes large, horizontal engineering efforts"],"exampleCriteria":null}]},{"name":"leadership","title":"👩‍💼 Leadership","content":[{"level":3,"criteria":["Onboards / mentors new engineers"],"exampleCriteria":[{"criteria":"Finds learning opportunities for others when reviewing their code and follows it up","examples":["I think this code could be improved by doing X, let's pair on it and I'll talk through why X is good for this"]}]},{"level":4,"criteria":["Contributes to maintaining the Monzo culture in their team, helping new joiners","Gets buy-in on technical decision-making and proposed designs","Proactively involves other relevant engineers","Sought out for code reviews","Instills Monzo engineering principles in other engineers","Helps the growth of engineers around them through coaching and mentoring","Helps their squad work together more effectively","Helps facilitate team/squad rituals"],"exampleCriteria":[{"criteria":"Makes improvements to modules/libraries/services and goes out of their way to help others learn from it","examples":["I've used RxJava for the first time here, I'm going to do a talk about why I've done this, here's some great blog posts on it"]}]},{"level":5,"criteria":["Instills Monzo engineering principles across a whole squad of engineers","Works with relevant Engineering Managers to help other engineers perform and grow","Fosters effective collaboration in multi-disciplinary squads (backend, mobile, data, design, web)","Delegates technical decisions with low risk and high reversibility","Owns technical decisions with high risk and low reversibility","Contributes to maintaining the Monzo culture in the wider company","Bootstraps new teams"],"exampleCriteria":null},{"level":6,"criteria":["Helps groups of squads work together more effectively","Starts things that they cannot finish by themselves","Delegates to make better use of their time"],"exampleCriteria":null}]},{"name":"influence","title":"✨ Influence","content":[{"level":1,"criteria":["Improves documentation that is incorrect"],"exampleCriteria":null},{"level":2,"criteria":["Proactively raises issues they spot in retrospectives"],"exampleCriteria":null},{"level":3,"criteria":["Actively comments on and engages with proposals","Proactively improves modules, services, systems and codebases they encounter, 'this doesn't make sense, I'm going to do something about it'"],"exampleCriteria":null},{"level":4,"criteria":["Contributes to data team blog","Maintains documentation on things they know the most, makes it easy for future engineers to interact with systems/code","Clears blockers for junior team members, provides context/guidance, or knows how to escalate"],"exampleCriteria":[{"criteria":"Contributes to data hiring","examples":["leads calls, does onsite interviews"]}]},{"level":5,"criteria":["Represents Monzo at conferences/events","Given as reason for other engineers to join Monzo","Proactively shares knowledge internally","Acts as the 'sole proprietor', in the CEO mindset, their ego/agenda is not a factor in their thinking or decision making"],"exampleCriteria":null},{"level":6,"criteria":["Attracts other very senior hires","Engineers around them get better and have a bigger impact, faster"],"exampleCriteria":null}]},{"name":"mastery","title":"🛠️ Mastery","content":[{"level":1,"criteria":["Comfortable with using git and contributing to our code base","Can extend existing data models and design simple new ones","Creates new Looker views and dashboards; extracts basic insights quickly from existing Looker explores","Strong SQL skills","Implements basic prediction models quickly","Basic Python or R skills","Delivers assigned tasks that meet expected criteria","Tries to unblock themselves first before seeking help","Works for the team, focuses on tasks that contribute to team goals"],"exampleCriteria":[{"criteria":"Demonstrates a good understanding of the business team they are partnering with","examples":["Knows how the team is organised, who is who, what are the goals, current priorities, biggest challenges etc."]},{"criteria":"Translates business questions into analysable hypothesis and answers those","examples":["Question from business 'Why do salaried users cost us twice as much on customer support?' → cost are allocated by number of intercom queries → salaried users must be generating more queries → Is of queries proportional to engagement? → Are all salaried users are over-proportionally struggling with particular problems (e.g. missing bank statements) → etc."]},{"criteria":"Picks the right visualisation types for the data at hand","examples":["distributions, time series, scatter plots etc"]},{"criteria":"Basic stats and math knowledge","examples":["Able to find a formula to calculate confidence intervals for different measurement scenarios, knows how to interpret those etc."]}]},{"level":2,"criteria":["Reasons well about about underlying principles of data modeling"],"exampleCriteria":[{"criteria":"Attention to details","examples":["whenever they deliver a piece of work or send a weekly KPIs report they don’t just blindly copy & paste; they sanity check whether things make sense and try to spot mistakes"]},{"criteria":"Manages their own time effectively, prioritises their workload well, on time for meetings, aware when blocking others and unblocks","examples":["able to focus on assigned tasks despite distractions from people, emails, slacks etc. Able to create a 'focus environment' for themselves","exhibits self-awareness around personal productivity (able to spot and debug personal productivity issues or to seek help/advice)"]},{"criteria":"Brings things to completion","examples":["analysts/data scientists often exhibit a behaviour where they run many analyses in parallel for a prolonged time without closing tasks off. Closing a task off could mean writing down key takeaway and sharing the findings with the relevant audience.","brings a model into a production experiment instead of continuing to tweak offline results"]}]},{"level":3,"criteria":["Consistently applies data modeling best practices and suggests ways to improve current practices in non trivial cases","Able determine what really matters for a particular analysis and understands what a 80/20 solution would look like and can prioritise accordingly"],"exampleCriteria":[{"criteria":"Able to pick the best tool and method to effectively help the business to answer a question/make a decision","examples":["Looker, SQL, python or spreadsheets + a basic chart, blackbox ML model or a structured scenario model etc) → Understands the problem at hand and proposes alternative suitable solutions rather trying to fit the problem to the favourite tool."]},{"criteria":"Concise, clear and effective communication","examples":["tailored to audience, clear and concise message (i.e no unnecessary details)","can be through emails, slack or presentations"]}]},{"level":4,"criteria":["Actively drives improvements of how the team works","Values teams success over individual success and company’s success over teams success","Onboards / mentors new team members","Gets buy-in on technical decision-making and proposed designs","Sought out for code reviews"],"exampleCriteria":[{"criteria":"Distinguishes clearly between urgent and important tasks and is able to focus on getting the important tasks done.","examples":["effectively manages expectations of other people","communicates priorities to their team and other relevant stakeholders"]},{"criteria":"Holds themselves and others accountable","examples":["Accountability is about delivering on a commitment. It’s responsibility to an outcome, not just a set of tasks."]},{"criteria":"Communicates complex ideas effectively","examples":["has the ability to chose the appropriate level of abstraction and make complexity easy to understand tips (see https://www.fastcompany.com/3045853/how-to-talk-about-complex-topics-without-dumbing-them-down)"]}]},{"level":5,"criteria":["Solves larger ambiguous/not well defined problems","Contributes to maintaining Monzo’s culture in the wider company","Proactively thinks about how we can get better at our purpose: quicker and better decisions based on data"],"exampleCriteria":[{"criteria":"Builds out a strong internal network","examples":["i.e. well connected through-out the company, also to teams with no direct common projects at the moment"]},{"criteria":"Has good organisational awareness","examples":["understands the process of how things are getting done in the company e.g. how and when goals are set, how decisions are being made, how priorities are defined etc."]},{"criteria":"Sees common patterns in similar tasks and thinks about the solution from the platform/systems perspective.","examples":["solutions that not only solve your own problem but also similar problems of other people in the company)"]}]},{"level":6,"criteria":["Delivers projects that require cross functional collaboration","Delegates to make better use of their time"],"exampleCriteria":null}]},{"name":"mastery-science","title":"🧪 Mastery - Data Science","content":[{"level":2,"criteria":["Familiar with ML batch serving techniques"],"exampleCriteria":[{"criteria":"Basic knowledge of standard ML approaches","examples":["linear regression, neural nets, clustering, random forests etc."]}]},{"level":3,"criteria":["Able to pick the right ML method for the problem at hand; demonstrates good intuition of how those approaches work and what strength/weaknesses they have","Distinguishes well between impactful ML problems vs just 'predicting something'"],"exampleCriteria":null},{"level":4,"criteria":["Thrown at fires and resolves / contributes heavily to resolving them","Replicates cutting edge approaches from research papers where required","Thinks about the future situations code will be used in, planning and acting accordingly","Makes pragmatic choices about taking on tech debt"],"exampleCriteria":[{"criteria":"Debugs complex Deep Neural Net code/issues","examples":["knows what to look at when the loss is not decreasing etc."]},{"criteria":"Validates ideas aggressively & iteratively","examples":["tackles the biggest unknowns first; validates ideas with 10% effort"]},{"criteria":"Measures, understands and is transparent about the impact of their ML work.","examples":["we should serve as role models for the rest of the company in this regard in particular"]}]},{"level":5,"criteria":["Technical authority within their immediate peer group (team/platform), the natural escalation point"],"exampleCriteria":[{"criteria":"Familiar with ML streaming, stateful and stateless serving techniques","examples":["can spec out and plan an implementation. Familiar with technological components that might be required"]}]},{"level":6,"criteria":["Serves as a technical authority in the wider data science community","Deep domain knowledge, can go lower than almost anyone else","Makes targeted improvements in stability, performance and scalability across our platform","Measurable impact on company level goals"],"exampleCriteria":null}]},{"name":"mastery-analytics","title":"📈 Mastery - Data Analytics","content":[{"level":3,"criteria":null,"exampleCriteria":[{"criteria":"Asks why. Does not take truths for granted unless they understand exactly where they are coming from","examples":["especially with regards to regulation, compliance, etc."]}]},{"level":4,"criteria":null,"exampleCriteria":[{"criteria":"Valued and trusted business partner for the teams they support","examples":["Can be mostly proxied by the type of questions their business partners are asking. 'Can you help me to solve this (hard) problem?' vs 'Can you please pull this number?'"]},{"criteria":"Proactively identifies relevant/impactful areas for analyses which would deepen the understanding of the business or enable decisions","examples":["during the planning process you contribute proactively to help your team to define the right priorities with relevant insights"]}]},{"level":5,"criteria":null,"exampleCriteria":[{"criteria":"Deep domain knowledge in specific areas, can go lower than almost anyone else","examples":["deep credit risk knowledge, user behaviour analytics etc"]}]},{"level":6,"criteria":["Comfortably supports and interacts with C-level executives"],"exampleCriteria":null}]}]}},"genericData":{"html":"","frontmatter":{"path":"/generic","title":"📄 Generic Framework","sidebarTitle":"📄 Generic","sidebarGroup":null,"yaml":true,"levels":6,"homepage":false,"topics":[{"name":"knowledge","title":"🧠 Knowledge","content":[{"level":1,"criteria":["Learning just as much as adding value","Has enough knowledge to make informed decisions","Doesn’t necessarily know what they don’t know"]},{"level":2,"criteria":["Identifies areas/subjects they don’t know and proactively seeks out knowledge","Increased domain knowledge","Aware of their weaknesses"]},{"level":3,"criteria":["Additional expertise or breadth of knowledge"]},{"level":4,"criteria":["Has depth of knowledge in a particular area and breadth of knowledge across their domain","You know who the experts are and delegate accordingly"]},{"level":5,"criteria":["Wide breadth of knowledge","Can easily context switch within their area and pick up new concepts"]},{"level":6,"criteria":["Has a high-level understanding of all the areas they own","Understands the wider business context"]}]},{"name":"impact","title":"💥 Impact","content":[{"level":1,"criteria":["Independently works on small, low-impact, well-defined task","Looks to optimise existing work (eg Processes, procedures, products, etc)"]},{"level":2,"criteria":["Delivers small, well-defined tasks/projects","Delegated low-impact problems to solve"]},{"level":3,"criteria":["Identifies problems to solve","Owns the implementation of the solution"]},{"level":4,"criteria":["Can take a long-term vision and define building blocks to get there"]},{"level":5,"criteria":["Understands the big picture and integrates company goals into their area"]},{"level":6,"criteria":["Is the accountable exec for high-impact projects"]}]},{"name":"communication","title":"💬 Communication","content":[{"level":1,"criteria":["Actively communicates what they are working on","Seeks out feedback"]},{"level":2,"criteria":["Can deliver their work to their team and others","Proactively gives feedback to those they work with"]},{"level":3,"criteria":["Clearly communicates throughout implementation of solutions","Can successfully get buy-in for their proposals"]},{"level":4,"criteria":["Communicates their area’s role within the larger mission of the company"]},{"level":5,"criteria":["Communicates the long-term vision & mission for the company and their area"]},{"level":6,"criteria":["An effective and inspiring communicator internally and externally"]}]},{"name":"teamwork","title":"🤝 Teamwork","content":[{"level":1,"criteria":["Works closely or in pairs with more senior members of the team when facing tasks for the first time","Needs support and guidance from managers, mentors and leads","Needs approval to ship projects of a certain impact","They may need support on how to navigate the professional environment"]},{"level":2,"criteria":["Starts to delegate tasks to peers","Collaborates within their team","Independently works and learns","Do not need to be checked in on daily"]},{"level":3,"criteria":["Collaborates across the organisation","Strong cultural understanding","Empowers those around them","Takes ownership of their own development"]},{"level":4,"criteria":["Leads through influence","Natural teacher, they’re able to formally and informally teach those around them","You unblock people within your area","You’re recognised for your impact on team culture and people want to work with you"]},{"level":5,"criteria":["You coach others to find the best solution","You inspire your team and can attract top talent to the organisation","You unblock people outside of your area"]},{"level":6,"criteria":["Leader of business culture and strategy","You own your area’s structure","Strong leadership and coaching abilities"]}]},{"name":"conduct","title":"👩‍💻 Conduct","content":[{"level":1,"criteria":["Follows policies and procedures applicable to role","Completes training","Identifies risks related to own areas"]},{"level":2,"criteria":["Applies and follows governance principles as they apply to role","Communicates and escalates risks related to own projects and business area","Ensures colleagues actively analyse and address risks in their area"]},{"level":3,"criteria":["Expert risk and compliance knowledge as relevant to role","Takes ownership for training others in risk & compliance as relevant to their role","Promptly and effectively deals with unforeseen risks as they arise"]},{"level":4,"criteria":["Uses knowledge of internal and external environment to develop strategy and internal policy","Applies sophisticated and creative analysis and recommends remediating action","Responds to complex issues devising smart strategies for the mitigation of risk"]},{"level":5,"criteria":["Participates in risk management and mitigation at the highest industry level","Leads by example and proves their area is managing risk and compliance within appetite","Gets involved in and identifies opportunities for colleagues to participate in advisory, strategic, industry bodies to learn and share best practice in their area of business"]},{"level":6,"criteria":["Creates a strong risk culture throughout the organisation","Owns policies and can evidence their compliance","Contributes to thought leadership on effective and creative risk management throughout the industry","Proactively identifies holistic measures to robust risk management and implements them company-wide"]}]}]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"isYaml":true}}